{
  "Travel": [
    {
      "imageUrl": "https://books.toscrape.com/media/cache/6d/41/6d418a73cc7d4ecfd75ca11d854041db.jpg",
      "bookTitle": "It's Only the Himalayas",
      "bookPrice": "£45.17",
      "available": " In stock (19 available)",
      "bookDescription": "“Wherever you go, whatever you do, just . . . don’t do anything stupid.” —My MotherDuring her yearlong adventure backpacking from South Africa to Singapore, S. Bedford definitely did a few things her mother might classify as \"stupid.\" She swam with great white sharks in South Africa, ran from lions in Zimbabwe, climbed a Himalayan mountain without training in Nepal, and wa “Wherever you go, whatever you do, just . . . don’t do anything stupid.” —My MotherDuring her yearlong adventure backpacking from South Africa to Singapore, S. Bedford definitely did a few things her mother might classify as \"stupid.\" She swam with great white sharks in South Africa, ran from lions in Zimbabwe, climbed a Himalayan mountain without training in Nepal, and watched as her friend was attacked by a monkey in Indonesia.But interspersed in those slightly more crazy moments, Sue Bedfored and her friend \"Sara the Stoic\" experienced the sights, sounds, life, and culture of fifteen countries. Joined along the way by a few friends and their aging fathers here and there, Sue and Sara experience the trip of a lifetime. They fall in love with the world, cultivate an appreciation for home, and discover who, or what, they want to become.It's Only the Himalayas is the incredibly funny, sometimes outlandish, always entertaining confession of a young backpacker that will inspire you to take your own adventure. ...more",
      "upc": "a22124811bfa8350"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/fe/8a/fe8af6ceec7718986380c0fde9b3b34f.jpg",
      "bookTitle": "Full Moon over Noah’s Ark: An Odyssey to Mount Ararat and Beyond",
      "bookPrice": "£49.43",
      "available": " In stock (15 available)",
      "bookDescription": "Acclaimed travel writer Rick Antonson sets his adventurous compass on Mount Ararat, exploring the region’s long history, religious mysteries, and complex politics.Mount Ararat is the most fabled mountain in the world. For millennia this massif in eastern Turkey has been rumored as the resting place of Noah’s Ark following the Great Flood. But it also plays a significant ro Acclaimed travel writer Rick Antonson sets his adventurous compass on Mount Ararat, exploring the region’s long history, religious mysteries, and complex politics.Mount Ararat is the most fabled mountain in the world. For millennia this massif in eastern Turkey has been rumored as the resting place of Noah’s Ark following the Great Flood. But it also plays a significant role in the longstanding conflict between Turkey and Armenia.Author Rick Antonson joined a five-member expedition to the mountain’s nearly 17,000-foot summit, trekking alongside a contingent of Armenians, for whom Mount Ararat is the stolen symbol of their country. Antonson weaves vivid historical anecdote with unexpected travel vignettes, whether tracing earlier mountaineering attempts on the peak, recounting the genocide of Armenians and its unresolved debate, or depicting the Kurds’ ambitions for their own nation’s borders, which some say should include Mount Ararat.What unfolds in Full Moon Over Noah’s Ark is one man’s odyssey, a tale told through many stories. Starting with the flooding of the Black Sea in 5600 BCE, through to the Epic of Gilgamesh and the contrasting narratives of the Great Flood known to followers of the Judaic, Christian and Islamic religions, Full Moon Over Noah’s Ark takes readers along with Antonson through the shadows and broad landscapes of Turkey, Iraq, Iran and Armenia, shedding light on a troubled but fascinating area of the world. ...more",
      "upc": "ce60436f52c5ee68"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/c7/1a/c71a85dbf8c2dbc75cb271026618477c.jpg",
      "bookTitle": "See America: A Celebration of Our National Parks & Treasured Sites",
      "bookPrice": "£48.87",
      "available": " In stock (14 available)",
      "bookDescription": "To coincide with the 2016 centennial anniversary of the National Parks Service, the Creative Action Network has partnered with the National Parks Conservation Association to revive and reimagine the legacy of WPA travel posters. Artists from all over the world have participated in the creation of this new, crowdsourced collection of See America posters for a modern era. Fe To coincide with the 2016 centennial anniversary of the National Parks Service, the Creative Action Network has partnered with the National Parks Conservation Association to revive and reimagine the legacy of WPA travel posters. Artists from all over the world have participated in the creation of this new, crowdsourced collection of See America posters for a modern era. Featuring artwork for 75 national parks and monuments across all 50 states, this engaging keepsake volume celebrates the full range of our nation's landmarks and treasured wilderness. ...more",
      "upc": "f9705c362f070608"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/ca/30/ca30b1afe1e76ce7ba1db8176d398e53.jpg",
      "bookTitle": "Vagabonding: An Uncommon Guide to the Art of Long-Term World Travel",
      "bookPrice": "£36.94",
      "available": " In stock (8 available)",
      "bookDescription": "With a new foreword by Tim Ferriss •There’s nothing like vagabonding: taking time off from your normal life—from six weeks to four months to two years—to discover and experience the world on your own terms. In this one-of-a-kind handbook, veteran travel writer Rolf Potts explains how anyone armed with an independent spirit can achieve the dream of extended overseas travel. With a new foreword by Tim Ferriss • There’s nothing like vagabonding: taking time off from your normal life—from six weeks to four months to two years—to discover and experience the world on your own terms. In this one-of-a-kind handbook, veteran travel writer Rolf Potts explains how anyone armed with an independent spirit can achieve the dream of extended overseas travel. Now completely revised and updated, Vagabonding is an accessible and inspiring guide to   • financing your travel time • determining your destination • adjusting to life on the road • working and volunteering overseas • handling travel adversity • re-assimilating back into ordinary life  Praise for Vagabonding  “A crucial reference for any budget wanderer.”—Time  “Vagabonding easily remains in my top-10 list of life-changing books. Why? Because one incredible trip, especially a long-term trip, can change your life forever. And Vagabonding teaches you how to travel (and think), not just for one trip, but for the rest of your life.”—Tim Ferriss, from the foreword   “The book is a meditation on the joys of hitting the road. . . . It’s also a primer for those with a case of pent-up wanderlust seeking to live the dream.”—USA Today   “I couldn’t put this book down. It’s a whole different ethic of travel. . . . [Potts’s] practical advice might just convince you to enjoy that open-ended trip of a lifetime.”—Rick Steves   “Potts wants us to wander, to explore, to embrace the unknown, and, finally, to take our own damn time about it. I think this is the most sensible book of travel-related advice ever written.”—Tim Cahill, founding editor of Outside ...more",
      "upc": "1809259a5a5f1d8d"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/45/21/4521c581ba727f5c835e34860cbf53e5.jpg",
      "bookTitle": "Under the Tuscan Sun",
      "bookPrice": "£37.33",
      "available": " In stock (7 available)",
      "bookDescription": "A CLASSIC FROM THE BESTSELLING AUTHOR OF UNDER MAGNOLIAFrances Mayes—widely published poet, gourmet cook, and travel writer—opens the door to a wondrous new world when she buys and restores an abandoned villa in the spectacular Tuscan countryside. In evocative language, she brings the reader along as she discovers the beauty and simplicity of life in Italy. Mayes also crea A CLASSIC FROM THE BESTSELLING AUTHOR OF UNDER MAGNOLIAFrances Mayes—widely published poet, gourmet cook, and travel writer—opens the door to a wondrous new world when she buys and restores an abandoned villa in the spectacular Tuscan countryside. In evocative language, she brings the reader along as she discovers the beauty and simplicity of life in Italy. Mayes also creates dozens of delicious seasonal recipes from her traditional kitchen and simple garden, all of which she includes in the book. Doing for Tuscany what M.F.K. Fisher and Peter Mayle did for Provence, Mayes writes about the tastes and pleasures of a foreign country with gusto and passion. ...more",
      "upc": "a94350ee74deaa07"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/6c/e3/6ce3003931701c7a3fd5354917538ea9.jpg",
      "bookTitle": "A Summer In Europe",
      "bookPrice": "£44.34",
      "available": " In stock (7 available)",
      "bookDescription": "On her thirtieth birthday, Gwendolyn Reese receives an unexpected present from her widowed Aunt Bea: a grand tour of Europe in the company of Bea's Sudoku and Mahjongg Club. The prospect isn't entirely appealing. But when the gift she is expecting--an engagement ring from her boyfriend--doesn't materialize, Gwen decides to go. At first, Gwen approaches the trip as if it's On her thirtieth birthday, Gwendolyn Reese receives an unexpected present from her widowed Aunt Bea: a grand tour of Europe in the company of Bea's Sudoku and Mahjongg Club. The prospect isn't entirely appealing. But when the gift she is expecting--an engagement ring from her boyfriend--doesn't materialize, Gwen decides to go. At first, Gwen approaches the trip as if it's the math homework she assigns her students, diligently checking monuments off her must-see list. But amid the bougainvillea and stunning vistas of southern Italy, something changes. Gwen begins to live in the moment--skipping down stone staircases in Capri, running her fingers over a glacier in view of the Matterhorn, racing through the Louvre, and taste-testing pastries at a Marseilles cafe. Reveling in every new experience--especially her attraction to a charismatic British physics professor--Gwen discovers that the ancient wonders around her are nothing compared to the renaissance unfolding within. . . \"A thinking woman's love story, it swept me away to breathtaking places with a cast of endearing characters I won't soon forget. Bravissima!\" Susan McBride, author of \"Little Black Dress\" Praise for Marilyn Brant's According to Jane \"A warm, witty and charmingly original story.\" --Susan Wiggs, \"New York Times \" bestselling author \"Brant infuses her sweetly romantic and delightfully clever tale with just the right dash of Austen-esque wit.\" \"Chicago Tribune\" \"An engaging read for all who have been through the long, dark, dating wars, and still believe there's sunshine, and a Mr. Darcy, at the end of the tunnel.\" --Cathy Lamb, author of \"Such a Pretty Face\"\" ...more",
      "upc": "cc1936a9f4e93477"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/d5/82/d582f6b0261c2842330e893962276295.jpg",
      "bookTitle": "The Great Railway Bazaar",
      "bookPrice": "£30.54",
      "available": " In stock (6 available)",
      "bookDescription": "First published more than thirty years ago, Paul Theroux's strange, unique, and hugely entertaining railway odyssey has become a modern classic of travel literature. Here Theroux recounts his early adventures on an unusual grand continental tour. Asia's fabled trains -- the Orient Express, the Khyber Pass Local, the Frontier Mail, the Golden Arrow to Kuala Lumpur, the Mand First published more than thirty years ago, Paul Theroux's strange, unique, and hugely entertaining railway odyssey has become a modern classic of travel literature. Here Theroux recounts his early adventures on an unusual grand continental tour. Asia's fabled trains -- the Orient Express, the Khyber Pass Local, the Frontier Mail, the Golden Arrow to Kuala Lumpur, the Mandalay Express, the Trans-Siberian Express -- are the stars of a journey that takes him on a loop eastbound from London's Victoria Station to Tokyo Central, then back from Japan on the Trans-Siberian. Brimming with Theroux's signature humor and wry observations, this engrossing chronicle is essential reading for both the ardent adventurer and the armchair traveler. ...more",
      "upc": "48736df57e7bec9f"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/8b/81/8b81cd9b2c8f89a12099a80bed1c4911.jpg",
      "bookTitle": "A Year in Provence (Provence #1)",
      "bookPrice": "£56.88",
      "available": " In stock (6 available)",
      "bookDescription": "National BestsellerIn this witty and warm-hearted account, Peter Mayle tells what it is like to realize a long-cherished dream and actually move into a 200-year-old stone farmhouse in the remote country of the Lubéron with his wife and two large dogs. He endures January's frosty mistral as it comes howling down the Rhône Valley, discovers the secrets of goat racing through National Bestseller In this witty and warm-hearted account, Peter Mayle tells what it is like to realize a long-cherished dream and actually move into a 200-year-old stone farmhouse in the remote country of the Lubéron with his wife and two large dogs. He endures January's frosty mistral as it comes howling down the Rhône Valley, discovers the secrets of goat racing through the middle of town, and delights in the glorious regional cuisine. A Year in Provence transports us into all the earthy pleasures of Provençal life and lets us live vicariously at a tempo governed by seasons, not by days. ...more",
      "upc": "9e60929f521fa280"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/26/f5/26f5d20239a45046e756c6d09611b3ea.jpg",
      "bookTitle": "The Road to Little Dribbling: Adventures of an American in Britain (Notes From a Small Island #2)",
      "bookPrice": "£23.21",
      "available": " In stock (3 available)",
      "bookDescription": "The hilarious and loving sequel to a hilarious and loving classic of travel writing: Notes from a Small Island, Bill Bryson’s valentine to his adopted country of EnglandIn 1995 Bill Bryson got into his car and took a weeks-long farewell motoring trip about England before moving his family back to the United States. The book about that trip, Notes from a Small Island, is up The hilarious and loving sequel to a hilarious and loving classic of travel writing: Notes from a Small Island, Bill Bryson’s valentine to his adopted country of EnglandIn 1995 Bill Bryson got into his car and took a weeks-long farewell motoring trip about England before moving his family back to the United States. The book about that trip, Notes from a Small Island, is uproarious and endlessly endearing, one of the most acute and affectionate portrayals of England in all its glorious eccentricity ever written. Two decades later, he set out again to rediscover that country, and the result is The Road to Little Dribbling. Nothing is funnier than Bill Bryson on the road—prepare for the total joy and multiple episodes of unseemly laughter. ...more",
      "upc": "366a236aa1ea6f07"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/c9/9a/c99a7a05537cd842eb4db83d537e3a4d.jpg",
      "bookTitle": "Neither Here nor There: Travels in Europe",
      "bookPrice": "£38.95",
      "available": " In stock (3 available)",
      "bookDescription": "Bill Bryson's first travel book, The Lost Continent, was unanimously acclaimed as one of the funniest books in years. In Neither Here nor There he brings his unique brand of humour to bear on Europe as he shoulders his backpack, keeps a tight hold on his wallet, and journeys from Hammerfest, the northernmost town on the continent, to Istanbul on the cusp of Asia. Fluent in Bill Bryson's first travel book, The Lost Continent, was unanimously acclaimed as one of the funniest books in years. In Neither Here nor There he brings his unique brand of humour to bear on Europe as he shoulders his backpack, keeps a tight hold on his wallet, and journeys from Hammerfest, the northernmost town on the continent, to Istanbul on the cusp of Asia. Fluent in, oh, at least one language, he retraces his travels as a student twenty years before.Whether braving the homicidal motorist of Paris, being robbed by gypsies in Florence, attempting not to order tripe and eyeballs in a German restaurant, window-shopping in the sex shops of the Reeperbahn or disputing his hotel bill in Copenhagen, Bryson takes in the sights, dissects the culture and illuminates each place and person with his hilariously caustic observations. He even goes to Liechtenstein. ...more",
      "upc": "747cf7fca2ccdbd4"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/9e/10/9e106f81f65b293e488718a4f54a6a3f.jpg",
      "bookTitle": "1,000 Places to See Before You Die",
      "bookPrice": "£26.08",
      "available": " In stock (1 available)",
      "bookDescription": "Around the World, continent by continent, here is the best the world has to offer: 1,000 places guaranteed to give travelers the shivers. Sacred ruins, grand hotels, wildlife preserves, hilltop villages, snack shacks, castles, festivals, reefs, restaurants, cathedrals, hidden islands, opera houses, museums, and more. Each entry tells exactly why it's essential to visit. Th Around the World, continent by continent, here is the best the world has to offer: 1,000 places guaranteed to give travelers the shivers. Sacred ruins, grand hotels, wildlife preserves, hilltop villages, snack shacks, castles, festivals, reefs, restaurants, cathedrals, hidden islands, opera houses, museums, and more. Each entry tells exactly why it's essential to visit. Then come the nuts and bolts: addresses, websites, phone and fax numbers, best times to visit. Stop dreaming and get going.This hefty volume reminds vacationers that hot tourist spots are small percentage of what's worth seeing out there. A quick sampling: Venice's Cipriani Hotel; California's Monterey Peninsula; the Lewis and Clark Trail in Oregon; the Great Wall of China; Robert Louis Stevenson's home in Western Samoa; and the Alhambra in Andalusia, Spain. Veteran travel guide writer Schultz divides the book geographically, presenting a little less than a page on each location. Each entry lists exactly where to find the spot (e.g. Moorea is located \"12 miles/19 km northwest of Tahiti; 10 minutes by air, 1 hour by boat\") and when to go (e.g., if you want to check out The Complete Fly Fisher hotel in Montana, \"May and Sept.-Oct. offer productive angling in a solitary setting\"). This is an excellent resource for the intrepid traveler.Copyright 2003 Reed Business Information, Inc. ...more",
      "upc": "228ba5e7577e1d49"
    }
  ],
  "Mystery": [
    {
      "imageUrl": "https://books.toscrape.com/media/cache/c0/59/c05972805aa7201171b8fc71a5b00292.jpg",
      "bookTitle": "Sharp Objects",
      "bookPrice": "£47.82",
      "available": " In stock (20 available)",
      "bookDescription": "WICKED above her hipbone, GIRL across her heart Words are like a road map to reporter Camille Preaker’s troubled past. Fresh from a brief stay at a psych hospital, Camille’s first assignment from the second-rate daily paper where she works brings her reluctantly back to her hometown to cover the murders of two preteen girls. NASTY on her kneecap, BABYDOLL on her leg Since WICKED above her hipbone, GIRL across her heart Words are like a road map to reporter Camille Preaker’s troubled past. Fresh from a brief stay at a psych hospital, Camille’s first assignment from the second-rate daily paper where she works brings her reluctantly back to her hometown to cover the murders of two preteen girls. NASTY on her kneecap, BABYDOLL on her leg Since she left town eight years ago, Camille has hardly spoken to her neurotic, hypochondriac mother or to the half-sister she barely knows: a beautiful thirteen-year-old with an eerie grip on the town. Now, installed again in her family’s Victorian mansion, Camille is haunted by the childhood tragedy she has spent her whole life trying to cut from her memory. HARMFUL on her wrist, WHORE on her ankle As Camille works to uncover the truth about these violent crimes, she finds herself identifying with the young victims—a bit too strongly. Clues keep leading to dead ends, forcing Camille to unravel the psychological puzzle of her own past to get at the story. Dogged by her own demons, Camille will have to confront what happened to her years before if she wants to survive this homecoming.With its taut, crafted writing, Sharp Objects is addictive, haunting, and unforgettable. ...more",
      "upc": "e00eb4fd7b871a48"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/95/84/95840dfd67c020067c99d70451147e20.jpg",
      "bookTitle": "In a Dark, Dark Wood",
      "bookPrice": "£19.63",
      "available": " In stock (18 available)",
      "bookDescription": "In a dark, dark wood Nora hasn't seen Clare for ten years. Not since Nora walked out of school one day and never went back. There was a dark, dark houseUntil, out of the blue, an invitation to Clare’s hen do arrives. Is this a chance for Nora to finally put her past behind her?And in the dark, dark house there was a dark, dark roomBut something goes wrong. Very wrong.And i In a dark, dark wood Nora hasn't seen Clare for ten years. Not since Nora walked out of school one day and never went back. There was a dark, dark houseUntil, out of the blue, an invitation to Clare’s hen do arrives. Is this a chance for Nora to finally put her past behind her?And in the dark, dark house there was a dark, dark roomBut something goes wrong. Very wrong.And in the dark, dark room.... Some things can’t stay secret for ever. ...more",
      "upc": "19ed25f4641d5efd"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/9d/f2/9df248dcefeaba9eeb519a59b248f72c.jpg",
      "bookTitle": "The Past Never Ends",
      "bookPrice": "£56.50",
      "available": " In stock (16 available)",
      "bookDescription": "A simple task, Attorney Chester Morgan thinks. Get a copy of a public record for a young man whose only friend has died in an unexplained accidental death. Except... The police file regarding the demise of sex worker Tanya Everly has been sealed by the order of the chief of police, and no one will talk. Warned to drop the matter, Attorney Morgan knows that if he doesn't sp A simple task, Attorney Chester Morgan thinks. Get a copy of a public record for a young man whose only friend has died in an unexplained accidental death. Except... The police file regarding the demise of sex worker Tanya Everly has been sealed by the order of the chief of police, and no one will talk. Warned to drop the matter, Attorney Morgan knows that if he doesn't speak for the dead young woman, no one will. Haunted by his discovery of the body of a prominent local oilman, Morgan pursues a quest for justice that puts his reputation, career, and life at risk. A journey that takes him into the dark shadows of the sex-for-sale business, into the marble courtrooms of Oklahoma, and into the aching loneliness of his own soul. Set in the American Southwest in the days before 9/11, The Past Never Ends is both a complex murder mystery and a meditation on the self-perpetuating nature of injustice and the ethereal nature of justice itself. ...more",
      "upc": "5ee94540d0749ea0"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/cc/bd/ccbd7a62caefd5a3a2e04dd7c2ff48fe.jpg",
      "bookTitle": "A Murder in Time",
      "bookPrice": "£16.64",
      "available": " In stock (16 available)",
      "bookDescription": "Beautiful and brilliant, Kendra Donovan is a rising star at the FBI. Yet her path to professional success hits a speed bump during a disastrous raid where half her team is murdered, a mole in the FBI is uncovered and she herself is severely wounded. As soon as she recovers, she goes rogue and travels to England to assassinate the man responsible for the deaths of her teamm Beautiful and brilliant, Kendra Donovan is a rising star at the FBI. Yet her path to professional success hits a speed bump during a disastrous raid where half her team is murdered, a mole in the FBI is uncovered and she herself is severely wounded. As soon as she recovers, she goes rogue and travels to England to assassinate the man responsible for the deaths of her teammates.While fleeing from an unexpected assassin herself, Kendra escapes into a stairwell that promises sanctuary but when she stumbles out again, she is in the same place - Aldrich Castle - but in a different time: 1815, to be exact.Mistaken for a lady's maid hired to help with weekend guests, Kendra is forced to quickly adapt to the time period until she can figure out how she got there; and, more importantly, how to get back home. However, after the body of a young girl is found on the extensive grounds of the county estate, she starts to feel there's some purpose to her bizarre circumstances. Stripped of her twenty-first century tools, Kendra must use her wits alone in order to unmask a cunning madman. ...more",
      "upc": "f733e8c19d40ec2e"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/86/38/8638ba095b3b32e0abdef170e7bc4fd6.jpg",
      "bookTitle": "The Murder of Roger Ackroyd (Hercule Poirot #4)",
      "bookPrice": "£44.10",
      "available": " In stock (15 available)",
      "bookDescription": "In the village of King's Abbot, a widow's sudden suicide sparks rumors that she murdered her first husband, was being blackmailed, and was carrying on a secret affair with the wealthy Roger Ackroyd. The following evening, Ackroyd is murdered in his locked study--but not before receiving a letter identifying the widow's blackmailer. King's Abbot is crawling with suspects, i In the village of King's Abbot, a widow's sudden suicide sparks rumors that she murdered her first husband, was being blackmailed, and was carrying on a secret affair with the wealthy Roger Ackroyd. The following evening, Ackroyd is murdered in his locked study--but not before receiving a letter identifying the widow's blackmailer. King's Abbot is crawling with suspects, including a nervous butler, Ackroyd's wayward stepson, and his sister-in-law, Mrs. Cecil Ackroyd, who has taken up residence in the victim's home. It's now up to the famous detective Hercule Poirot, who has retired to King's Abbot to garden, to solve the case of who killed Roger Ackroyd--a task in which he is aided by the village doctor and narrator, James Sheppard, and by Sheppard's ingenious sister, Caroline.The Murder of Roger Ackroyd is the book that made Agatha Christie a household name and launched her career as a perennial bestseller. Originally published in 1926, it is a landmark in the mystery genre. It was in the vanguard of a new class of popular detective fiction that ushered in the modern era of mystery novels. ...more",
      "upc": "c7b5183f4d1d4efe"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/e6/dc/e6dcc8f75214eb14edc1ce09c98f3d71.jpg",
      "bookTitle": "The Last Mile (Amos Decker #2)",
      "bookPrice": "£54.21",
      "available": " In stock (14 available)",
      "bookDescription": "In his #1 New York Times bestseller Memory Man, David Baldacci introduced the extraordinary detective Amos Decker-the man who can forget nothing. Now, Decker returns in a spectacular new thriller . . . THE LAST MILEConvicted murderer Melvin Mars is counting down the last hours before his execution--for the violent killing of his parents twenty years earlier--when he's gran In his #1 New York Times bestseller Memory Man, David Baldacci introduced the extraordinary detective Amos Decker-the man who can forget nothing. Now, Decker returns in a spectacular new thriller . . . THE LAST MILEConvicted murderer Melvin Mars is counting down the last hours before his execution--for the violent killing of his parents twenty years earlier--when he's granted an unexpected reprieve. Another man has confessed to the crime.Amos Decker, newly hired on an FBI special task force, takes an interest in Mars's case after discovering the striking similarities to his own life: Both men were talented football players with promising careers cut short by tragedy. Both men's families were brutally murdered. And in both cases, another suspect came forward, years after the killing, to confess to the crime. A suspect who may or may not have been telling the truth.The confession has the potential to make Melvin Mars--guilty or not--a free man. Who wants Mars out of prison? And why now?But when a member of Decker's team disappears, it becomes clear that something much larger--and more sinister--than just one convicted criminal's life hangs in the balance. Decker will need all of his extraordinary brainpower to stop an innocent man from being executed. ...more",
      "upc": "3bc89353f7e3a3cc"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/23/b8/23b81994234ac127d701db1531a08e48.jpg",
      "bookTitle": "That Darkness (Gardiner and Renner #1)",
      "bookPrice": "£13.92",
      "available": " In stock (14 available)",
      "bookDescription": "As a forensic investigator for the Cleveland Police Department, Maggie Gardiner has seen her share of Jane Does. The latest is an unidentified female in her early teens, discovered in a local cemetery. More shocking than the girl’s injuries—for Maggie at least—is the fact that no one has reported her missing. She and the detectives assigned to the case (including her cop e As a forensic investigator for the Cleveland Police Department, Maggie Gardiner has seen her share of Jane Does. The latest is an unidentified female in her early teens, discovered in a local cemetery. More shocking than the girl’s injuries—for Maggie at least—is the fact that no one has reported her missing. She and the detectives assigned to the case (including her cop ex-husband) are determined to follow every lead, run down every scrap of evidence. But the monster they seek is watching each move, closer to them than they could ever imagine. Jack Renner is a killer. He doesn’t murder because he savors it, or because he believes himself omnipotent, or for any reason other than to make the world a safer place. When he follows the trail of this Jane Doe to a locked room in a small apartment where eighteen teenaged girls are anything but safe, he knows something must be done. But his pursuit of their captor takes an unexpected turn.Maggie Gardiner finds another body waiting for her in the autopsy room—and a host of questions that will challenge everything she believes about justice, morality, and the true nature of evil … ...more",
      "upc": "0c7b9cf2b7662b65"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/74/9b/749bca168778cf35fdb2441a9d6b403f.jpg",
      "bookTitle": "Tastes Like Fear (DI Marnie Rome #3)",
      "bookPrice": "£10.69",
      "available": " In stock (14 available)",
      "bookDescription": "Sarah Hilary won the 2015 Theakston's Crime Novel of the Year with her debut, the 2014 Richard and Judy pick SOMEONE ELSE'S SKIN. She followed up with NO OTHER DARKNESS, proclaimed as 'riveting' by Lisa Gardner and 'truly mesmerising' by David Mark. Now D.I. Marnie Rome returns in her third novel.Home is where Harm lies...The young girl who causes the fatal car crash disap Sarah Hilary won the 2015 Theakston's Crime Novel of the Year with her debut, the 2014 Richard and Judy pick SOMEONE ELSE'S SKIN. She followed up with NO OTHER DARKNESS, proclaimed as 'riveting' by Lisa Gardner and 'truly mesmerising' by David Mark. Now D.I. Marnie Rome returns in her third novel.Home is where Harm lies...The young girl who causes the fatal car crash disappears from the scene.A runaway who doesn't want to be found, she only wants to go home.To the one man who understands her.Gives her shelter. Just as he gives shelter to the other lost girls who live in his house.He's the head of her new family.He's Harm. And when Harm's family is threatened, Marnie Rome is about to find out that everything tastes like fear... ...more",
      "upc": "2d1e337aaf341858"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/f1/37/f137a410ed7d6fcfce17d081caf97915.jpg",
      "bookTitle": "A Time of Torment (Charlie Parker #14)",
      "bookPrice": "£48.35",
      "available": " In stock (14 available)",
      "bookDescription": "Jerome Burnel was once a hero. He intervened to prevent multiple killings and in doing so damned himself. His life was torn apart. He was imprisoned, brutalized.But in his final days, with the hunters circling, he tells his story to private detective Charlie Parker. He speaks of the girl who was marked for death but was saved, of the ones who tormented him, and an entity t Jerome Burnel was once a hero. He intervened to prevent multiple killings and in doing so damned himself. His life was torn apart. He was imprisoned, brutalized.But in his final days, with the hunters circling, he tells his story to private detective Charlie Parker. He speaks of the girl who was marked for death but was saved, of the ones who tormented him, and an entity that hides in a ruined stockade.Parker is not like other men. He died, and was reborn. He is ready to wage war.Now he will descend upon a strange, isolated community called the Cut, and face down a force of men who rule by terror, intimidation, and murder.All in the name of the being they serve.All in the name of the Dead King. ...more",
      "upc": "4416c474713ec1f5"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/27/40/274003f2720f82844873945b87af6c19.jpg",
      "bookTitle": "A Study in Scarlet (Sherlock Holmes #1)",
      "bookPrice": "£16.73",
      "available": " In stock (14 available)",
      "bookDescription": "In the debut of literature's most famous sleuth, a dead man is discovered in a bloodstained room in Brixton. The only clues are a wedding ring, a gold watch, a pocket edition of Boccaccio's Decameron, and a word scrawled in blood on the wall. With this investigation begins the partnership of Sherlock Holmes and Dr. Watson. Their search for the murderer uncovers a story of In the debut of literature's most famous sleuth, a dead man is discovered in a bloodstained room in Brixton. The only clues are a wedding ring, a gold watch, a pocket edition of Boccaccio's Decameron, and a word scrawled in blood on the wall. With this investigation begins the partnership of Sherlock Holmes and Dr. Watson. Their search for the murderer uncovers a story of love and revenge-and heralds a franchise of detective mysteries starring the formidable Holmes. ...more",
      "upc": "63ee5bc46066a8a8"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/8d/52/8d52227d29e03695ef755620078b7815.jpg",
      "bookTitle": "Poisonous (Max Revere Novels #3)",
      "bookPrice": "£26.80",
      "available": " In stock (12 available)",
      "bookDescription": "Teen-aged Internet bully Ivy Lake fell off a cliff and few people cared ... except her mentally-challenged eighteen-year-old step-brother, Tommy. He loved her in spite of her cruelty. He's distraught and doesn't understand why his blended family is falling apart. After a year, the police still have no answers: Ivy could have jumped, could have been pushed, or it could have Teen-aged Internet bully Ivy Lake fell off a cliff and few people cared ... except her mentally-challenged eighteen-year-old step-brother, Tommy. He loved her in spite of her cruelty. He's distraught and doesn't understand why his blended family is falling apart. After a year, the police still have no answers: Ivy could have jumped, could have been pushed, or it could have been an accident. With too many suspects and not enough evidence, the investigation has grown cold.Tommy thinks that if someone can figure out what happened to his step-sister, everything will go back to normal, so he writes to investigative reporter Maxine Revere. This isn’t the type of case Max normally takes on, but the heartbreak and simple honesty in Tommy's letter pulls her in. She travels to Corte Madera, California, with her assistant David Kane and is at first pleased that the police are cooperative. But the more Max learns about Tommy and his dysfunctional family, the more she thinks she’s taken on an impossible task: this may be the one case she can’t solve.If Ivy was murdered, it was exceptionally well-planned and that kind of killer could be hiding in plain sight ... planning the next act of violence. Max believes the truth is always better than lies, that the truth is the only thing that matters to gain justice for victims and their families. But for the first time, she wonders if this time, the truth will kill. ...more",
      "upc": "abdd91e96515a617"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/19/74/19748437aac103dbdeb1918062728726.jpg",
      "bookTitle": "Murder at the 42nd Street Library (Raymond Ambler #1)",
      "bookPrice": "£54.36",
      "available": " In stock (12 available)",
      "bookDescription": "Murder at the 42nd Street Library opens with a murder in a second floor office of the iconic, beaux-arts flagship of the New York Public Library. Ray Ambler, the curator of the library's crime fiction collection, joins forces with NYPD homicide detective Mike Cosgrove in hopes of bringing a murderer to justice.In his search for the reasons behind the murder, Ambler uncover Murder at the 42nd Street Library opens with a murder in a second floor office of the iconic, beaux-arts flagship of the New York Public Library. Ray Ambler, the curator of the library's crime fiction collection, joins forces with NYPD homicide detective Mike Cosgrove in hopes of bringing a murderer to justice.In his search for the reasons behind the murder, Ambler uncovers hidden--and profoundly disturbing--relationships between visitors to the library. These include a celebrated mystery writer who has donated his papers to the library's crime fiction collection, that writer's missing daughter, a New York society woman with a hidden past, and one of Ambler's colleagues at the world-famous library. Those shocking revelations lead inexorably to the tragic and violent events that follow. ...more",
      "upc": "e7fe3bf2768602cf"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/fa/b5/fab5e650b19b76c5f5d1ce3a626376b1.jpg",
      "bookTitle": "Most Wanted",
      "bookPrice": "£35.28",
      "available": " In stock (12 available)",
      "bookDescription": "Lisa Scottoline delivers another searing, powerful blockbuster novel that explores hot-button issues within the framework of an intricately plotted thriller. When a woman and her husband, desperate for a baby, find themselves unable to conceive, they decide to take further steps. Since it is the husband who is infertile, the heroine decides to use a donor. And all seems to Lisa Scottoline delivers another searing, powerful blockbuster novel that explores hot-button issues within the framework of an intricately plotted thriller. When a woman and her husband, desperate for a baby, find themselves unable to conceive, they decide to take further steps. Since it is the husband who is infertile, the heroine decides to use a donor. And all seems to be well. Three months pass and she is happily pregnant. But a shocking revelation occurs when she discovers that a man arrested for a series of brutal murders is her donor - the biological father of the child she is carrying. Delving deeper to uncover the truth, the heroine must face her worst fears, and confront a terrifying truth. Most Wanted is sure to be Lisa Scottoline's most discussed, bestselling novel yet. ...more",
      "upc": "c039f5aceb093537"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/b2/c5/b2c501b848bccd9cc375771f53c0fb6e.jpg",
      "bookTitle": "Hide Away (Eve Duncan #20)",
      "bookPrice": "£11.84",
      "available": " In stock (12 available)",
      "bookDescription": "Iris Johansen's beloved forensic sculptor Eve Duncan is back and now the stakes are higher than ever. Dramatic changes are on the horizon for Eve and Joe Quinn and their relationship may never be the same. Faced with the task of protecting Cara Delaney, a young girl with ruthless enemies who want to see her dead, Eve takes her away to the remote Scottish Highlands where th Iris Johansen's beloved forensic sculptor Eve Duncan is back and now the stakes are higher than ever. Dramatic changes are on the horizon for Eve and Joe Quinn and their relationship may never be the same. Faced with the task of protecting Cara Delaney, a young girl with ruthless enemies who want to see her dead, Eve takes her away to the remote Scottish Highlands where they join Jane MacGuire in search of a hidden treasure. But nowhere is far enough away to protect Cara from danger. With enemies closing in from all sides, Hide Away is a high-octane thriller that fans will not want to miss. ...more",
      "upc": "bddc6fd036eb6279"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/91/8c/918c2c95ae90495cdb0371a22b726d82.jpg",
      "bookTitle": "Boar Island (Anna Pigeon #19)",
      "bookPrice": "£59.48",
      "available": " In stock (12 available)",
      "bookDescription": "Bringing you a gripping mystery, Nevada Barr transports you to the wild and dangerous landscapes of America's National Parks and is sure to appeal if you like Sue Grafton and Janet Evanovich.The eighteenth sensational crime novel from New York Times bestselling author Nevada Barr featuring fearless park ranger Anna Pigeon as she battles to solve a heinous crime set amidst Bringing you a gripping mystery, Nevada Barr transports you to the wild and dangerous landscapes of America's National Parks and is sure to appeal if you like Sue Grafton and Janet Evanovich.The eighteenth sensational crime novel from New York Times bestselling author Nevada Barr featuring fearless park ranger Anna Pigeon as she battles to solve a heinous crime set amidst the wild and dangerous landscape of a US National Park. ...more",
      "upc": "49b24c6a41b82bd2"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/e4/37/e43737572b04c7ad28b35f3da29eb8dd.jpg",
      "bookTitle": "The Widow",
      "bookPrice": "£27.26",
      "available": " In stock (11 available)",
      "bookDescription": "THE NEW YORK TIMESBESTSELLERFor fans of Gone Girl and The Girl on the Train, an electrifying thriller that will take you into the dark spaces that exist between a husband and a wife.When the police started asking questions, Jean Taylor turned into a different woman. One who enabled her and her husband to carry on, when more bad things began to happen... But that woman’s h THE NEW YORK TIMES BESTSELLERFor fans of Gone Girl and The Girl on the Train, an electrifying thriller that will take you into the dark spaces that exist between a husband and a wife.When the police started asking questions, Jean Taylor turned into a different woman. One who enabled her and her husband to carry on, when more bad things began to happen...   But that woman’s husband died last week. And Jean doesn’t have to be her anymore.   There’s a lot Jean hasn’t said over the years about the crime her husband was suspected of committing. She was too busy being the perfect wife, standing by her man while living with the accusing glares and the anonymous harassment.   Now there’s no reason to stay quiet. There are people who want to hear her story. They want to know what it was like living with that man. She can tell them that there were secrets. There always are in a marriage.   The truth—that’s all anyone wants. But the one lesson Jean has learned in the last few years is that she can make people believe anything… ...more",
      "upc": "6159d8b187831770"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/09/02/0902666ade8ab8183363e53c108e5069.jpg",
      "bookTitle": "Playing with Fire",
      "bookPrice": "£13.71",
      "available": " In stock (11 available)",
      "bookDescription": "A beautiful violinist is haunted by a very old piece of music she finds in a strange antique shop in Rome.The first time Julia Ansdell picks up The Incendio Waltz, she knows it’s a strikingly unusual composition. But while playing the piece, Julia blacks out and awakens to find her young daughter implicated in acts of surprising violence. And when she travels to Venice to A beautiful violinist is haunted by a very old piece of music she finds in a strange antique shop in Rome.The first time Julia Ansdell picks up The Incendio Waltz, she knows it’s a strikingly unusual composition. But while playing the piece, Julia blacks out and awakens to find her young daughter implicated in acts of surprising violence. And when she travels to Venice to find the previous owner of the music, she uncovers a dark secret that involves dangerously powerful people—a family who would stop at nothing to keep Julia from bringing the truth to light. ...more",
      "upc": "05a61a3bd8ca4149"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/2c/68/2c6857eb1c10995c8b9e77a1804f68cd.jpg",
      "bookTitle": "What Happened on Beale Street (Secrets of the South Mysteries #2)",
      "bookPrice": "£25.37",
      "available": " In stock (7 available)",
      "bookDescription": "What Happened on Beale Street is an exciting addition to the Secrets of the South Mysteries from bestselling author Mary Ellis. These standalone, complex crime dramas follow a private investigator's quest to make the world a better place...solving one case at a time.A cryptic plea for help from a childhood friend sends cousins Nate and Nicki Price from New Orleans to Memph What Happened on Beale Street is an exciting addition to the Secrets of the South Mysteries from bestselling author Mary Ellis. These standalone, complex crime dramas follow a private investigator's quest to make the world a better place...solving one case at a time.A cryptic plea for help from a childhood friend sends cousins Nate and Nicki Price from New Orleans to Memphis, the home of scrumptious barbecue and soulful blues music. When they arrive at Danny Andre's last known address, they discover signs of a struggle and a lifestyle not in keeping with the former choirboy they fondly remember.Danny's sister, Isabelle, reluctantly accepts their help. She and Nate aren't on the best of terms due to a complicated past, yet they will have to get beyond that if they want to save Danny.On top of Danny's alarming disappearance and his troubled relationship with Isabelle, Nate also has to rein in his favorite cousin's overzealousness as a new and eager PI. Confronted with a possible murder, mystery, and mayhem in the land of the Delta blues, Nate must rely on his faith and investigative experience to keep one or more of them from getting killed. ...more",
      "upc": "9735c969c652dd89"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/38/a4/38a44ac4f642f4717d865c81ec594529.jpg",
      "bookTitle": "The Bachelor Girl's Guide to Murder (Herringford and Watts Mysteries #1)",
      "bookPrice": "£52.30",
      "available": " In stock (7 available)",
      "bookDescription": "In 1910 Toronto, while other bachelor girls perfect their domestic skills and find husbands, two friends perfect their sleuthing skills and find a murderer.Inspired by their fascination with all things Sherlock Holmes, best friends and flatmates Merinda and Jem launch a consulting detective business. The deaths of young Irish women lead Merinda and Jem deeper into the mire In 1910 Toronto, while other bachelor girls perfect their domestic skills and find husbands, two friends perfect their sleuthing skills and find a murderer.Inspired by their fascination with all things Sherlock Holmes, best friends and flatmates Merinda and Jem launch a consulting detective business. The deaths of young Irish women lead Merinda and Jem deeper into the mire of the city's underbelly, where the high hopes of those dreaming to make a new life in Canada are met with prejudice and squalor.While searching for answers, donning disguises, and sneaking around where no proper ladies would ever go, they pair with Jasper Forth, a police constable, and Ray DeLuca, a reporter in whom Jem takes a more than professional interest. Merinda could well be Toronto's premiere consulting detective, and Jem may just find a way to put her bachelor girlhood behind her forever--if they can stay alive long enough to do so. ...more",
      "upc": "20789fb17b423c4c"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/5c/8a/5c8acde540a88aed464ab5c52bafcd83.jpg",
      "bookTitle": "Delivering the Truth (Quaker Midwife Mystery #1)",
      "bookPrice": "£20.89",
      "available": " In stock (7 available)",
      "bookDescription": "Quaker midwife Rose Carroll hears secrets and keeps confidences as she attends births of the rich and poor alike in an 1888 Massachusetts mill town. When the town’s world-famed carriage industry is threatened by the work of an arsonist, and a carriage factory owner’s adult son is stabbed to death with Rose's own knitting needle, she is drawn into solving the mystery. Thing Quaker midwife Rose Carroll hears secrets and keeps con­fi­dences as she attends births of the rich and poor alike in an 1888 Massachusetts mill town. When the town’s world-famed car­riage indus­try is threat­ened by the work of an arson­ist, and a car­riage fac­tory owner’s adult son is stabbed to death with Rose's own knitting needle, she is drawn into solv­ing the mys­tery. Things get dicey after the same owner’s mis­tress is also mur­dered, leav­ing her one-week-old baby with­out a mother. The Quaker poet and abolitionist John Greenleaf Whittier helps Rose by lending words of advice and support. While strug­gling with being less than the per­fect Friend, Rose draws on her strengths as a counselor and prob­lem solver to bring two mur­der­ers to justice before they destroy the town’s carriage industry and the people who run it. ...more",
      "upc": "4e980425468708da"
    }
  ],
  "Historical Fiction": [
    {
      "imageUrl": "https://books.toscrape.com/media/cache/08/e9/08e94f3731d7d6b760dfbfbc02ca5c62.jpg",
      "bookTitle": "Tipping the Velvet",
      "bookPrice": "£53.74",
      "available": " In stock (20 available)",
      "bookDescription": "\"Erotic and absorbing...Written with starling power.\"--\"The New York Times Book Review \" Nan King, an oyster girl, is captivated by the music hall phenomenon Kitty Butler, a male impersonator extraordinaire treading the boards in Canterbury. Through a friend at the box office, Nan manages to visit all her shows and finally meet her heroine. Soon after, she becomes Kitty's \"Erotic and absorbing...Written with starling power.\"--\"The New York Times Book Review \" Nan King, an oyster girl, is captivated by the music hall phenomenon Kitty Butler, a male impersonator extraordinaire treading the boards in Canterbury. Through a friend at the box office, Nan manages to visit all her shows and finally meet her heroine. Soon after, she becomes Kitty's dresser and the two head for the bright lights of Leicester Square where they begin a glittering career as music-hall stars in an all-singing and dancing double act. At the same time, behind closed doors, they admit their attraction to each other and their affair begins. ...more",
      "upc": "90fa61229261140a"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/f9/9e/f99e760b894d10c6e5ed578618918367.jpg",
      "bookTitle": "Forever and Forever: The Courtship of Henry Longfellow and Fanny Appleton",
      "bookPrice": "£29.69",
      "available": " In stock (16 available)",
      "bookDescription": "A Proper Historical Romance seriesThe first book in a new series which will focus on the lives of real historical figures who have intriguing stories of courtship that are recreated in fictionalized accounts based on real biographical and social history research.\"A well-researched, emotionally charged tale. A love story...fit for the ages.\" -Publishers Weekly.It's 1836, an A Proper Historical Romance seriesThe first book in a new series which will focus on the lives of real historical figures who have intriguing stories of courtship that are recreated in fictionalized accounts based on real biographical and social history research.\"A well-researched, emotionally charged tale. A love story...fit for the ages.\" -Publishers Weekly.It's 1836, and nineteen-year-old Fanny Appleton, a privileged daughter of a wealthy, upper-class Boston industrialist, is touring Europe with her family. Like many girls of her day, she enjoys the fine clothes, food, and company of the elite social circles. But unlike her peers, Fanny is also drawn to education, literature, and more intellectual pursuits.Published author and poet Henry Wadsworth Longfellow is also touring Europe, but under much different circumstances. Widowed while on tour, he has stayed in order to gather credentials that he hopes will secure his professorship at Harvard College. When Henry meets Fanny, he sees in her a kindred spirit, a lover of language and literature and high ideals. He is in love. Fanny, however, is uncertain. He is ten years older than she is, and from a much lower social class. How could such a relationship ever thrive?Could a book of Henry’s poetry, personally delivered, persuade Fanny to believe in a love that lasts forever and forever? ...more",
      "upc": "9beb96a2300109d7"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/ec/65/ec651ed66822d4b68938afa645b1ece2.jpg",
      "bookTitle": "A Flight of Arrows (The Pathfinders #2)",
      "bookPrice": "£55.53",
      "available": " In stock (16 available)",
      "bookDescription": "October 1776--August 1777It is said that what a man sows he will reap--and for such a harvest there is no set season. No one connected to Reginald Aubrey is untouched by the crime he committed twenty years ago. Not William, the Oneida child Reginald stole and raised as his own. Identity shattered, enlisted in the British army, William trains with Loyalist refugees eager to October 1776--August 1777It is said that what a man sows he will reap--and for such a harvest there is no set season. No one connected to Reginald Aubrey is untouched by the crime he committed twenty years ago. Not William, the Oneida child Reginald stole and raised as his own. Identity shattered, enlisted in the British army, William trains with Loyalist refugees eager to annihilate the rebels who forced them into exile. Coming to terms with who and what he is proves impossible, but if he breaks his Loyalist oath, he'll be no better than the man who constructed his life of lies.Not Anna, Reginald's adopted daughter, nor Two Hawks, William's twin, both who long for Reginald to accept their love despite the challenges they will face, building a marriage that bridges two cultures. Not Good Voice and Stone Thrower, freed of bitterness by a courageous act of forgiveness, but still yearning for their firstborn son and fearful for the future of their Oneida people.As the British prepare to attack frontier New York and Patriot regiments rally to defend it, two families separated by culture, united by love, will do all in their power to reclaim the son marching toward them in the ranks of their enemies. ...more",
      "upc": "3a6fb983e2554023"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/46/a2/46a2c968bfccf1979cc5576085eec6dd.jpg",
      "bookTitle": "The House by the Lake",
      "bookPrice": "£36.95",
      "available": " In stock (15 available)",
      "bookDescription": "Anna is content with her well-ordered life in San Francisco. But her world is turned upside down when her beloved grandfather, Max, reveals a startling secret: Anna is part of an aristocratic family who lost everything during World War II. What’s more, Max was forced to leave behind a precious item over seventy years ago in their estate in old Prussia. It’s now his ardent Anna is content with her well-ordered life in San Francisco. But her world is turned upside down when her beloved grandfather, Max, reveals a startling secret: Anna is part of an aristocratic family who lost everything during World War II. What’s more, Max was forced to leave behind a precious item over seventy years ago in their estate in old Prussia. It’s now his ardent wish that Anna retrieve it.Anna burns with questions as she heads for Germany: What memento could be so important to her grandfather? And why did he keep their history hidden? As she searches for answers, she finds herself drawn to Wil, a man who may hold the key to unlock the mystery. Together they discover that her family’s secrets are linked with an abandoned apartment in Paris, and these secrets go deeper than she ever imagined.Alternating between 1930s Europe and the present, The House by the Lake illuminates the destiny of a family caught in the tumult of history. ...more",
      "upc": "9287e238d7c3b06e"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/b4/45/b445dbc81ca3aff1321a6bf0d0fa231d.jpg",
      "bookTitle": "Mrs. Houdini",
      "bookPrice": "£30.25",
      "available": " In stock (15 available)",
      "bookDescription": "A captivating debut novel, meticulously researched and beautifully imagined, about the passionate marriage of Harry and Bess Houdini—a love story that defied death itself.Before escape artist Harry Houdini died, he vowed he would find a way to speak to his beloved wife Bess from beyond the grave using a coded message known only to the two of them. When a widowed Bess begin A captivating debut novel, meticulously researched and beautifully imagined, about the passionate marriage of Harry and Bess Houdini—a love story that defied death itself.Before escape artist Harry Houdini died, he vowed he would find a way to speak to his beloved wife Bess from beyond the grave using a coded message known only to the two of them. When a widowed Bess begins seeing this code in seemingly impossible places, it becomes clear that Harry has an urgent message to convey. Unlocking the puzzle will set Bess on a course back through the pair’s extraordinary romance, which swept the illusionist and his bride from the beaches of Coney Island, to the palaces of Budapest, to the back lots of Hollywood. When the mystery finally leads Bess to the doorstep of a mysterious young photographer, she realizes that her husband’s magic may have been more than just illusion.In surprising turns that weave through the uncertain days of the dawn of the twentieth century and continue into the dazzling 1920s, Mrs. Houdini is a thrilling tale that will take you deep into the heart of one of history’s greatest love stories—asking what drives people to believe in something bigger than themselves—even as it reveals the famous magician’s most remarkable feat of all. ...more",
      "upc": "a40723994f715420"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/33/8e/338e196723f3fb10d5c6990fe54be61d.jpg",
      "bookTitle": "The Marriage of Opposites",
      "bookPrice": "£28.08",
      "available": " In stock (14 available)",
      "bookDescription": "From the New York Times bestselling author of The Dovekeepers and The Museum of Extraordinary Things: a forbidden love story set on the tropical island of St. Thomas about the extraordinary woman who gave birth to painter Camille Pissarro; the Father of Impressionism.Growing up on idyllic St. Thomas in the early 1800s, Rachel dreams of life in faraway Paris. Rachel's mothe From the New York Times bestselling author of The Dovekeepers and The Museum of Extraordinary Things: a forbidden love story set on the tropical island of St. Thomas about the extraordinary woman who gave birth to painter Camille Pissarro; the Father of Impressionism.Growing up on idyllic St. Thomas in the early 1800s, Rachel dreams of life in faraway Paris. Rachel's mother, a pillar of their small refugee community of Jews who escaped the Inquisition, has never forgiven her daughter for being a difficult girl who refuses to live by the rules. Growing up, Rachel's salvation is their maid Adelle's belief in her strengths, and her deep, life-long friendship with Jestine, Adelle's daughter. But Rachel's life is not her own. She is married off to a widower with three children to save her father's business. When her husband dies suddenly and his handsome, much younger nephew, Fréderick, arrives from France to settle the estate, Rachel seizes her own life story, beginning a defiant, passionate love affair that sparks a scandal that affects all of her family, including her favorite son, who will become one of the greatest artists of France.Building on the triumphs of The Dovekeepers and The Museum of Extraordinary Things, set in a world of almost unimaginable beauty, The Marriage of Opposites showcases the beloved, bestselling Alice Hoffman at the height of her considerable powers. Once forgotten to history, the marriage of Rachel and Fréderick is a story that is as unforgettable as it is remarkable. ...more",
      "upc": "52cf2a5933ec5d8f"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/06/ac/06ac98df817412ce2419c4509fa98c80.jpg",
      "bookTitle": "Glory over Everything: Beyond The Kitchen House",
      "bookPrice": "£45.84",
      "available": " In stock (14 available)",
      "bookDescription": "From the author of the New York Times bestseller and beloved book club favorite The Kitchen House, a novel of family and long-buried secrets along the treacherous Underground Railroad.Jamie Pyke, son of both a slave and master of Tall Oakes, has a deadly secret that compels him to take a treacherous journey through the Underground Railroad.Published in 2010, The Kitchen Ho From the author of the New York Times bestseller and beloved book club favorite The Kitchen House, a novel of family and long-buried secrets along the treacherous Underground Railroad.Jamie Pyke, son of both a slave and master of Tall Oakes, has a deadly secret that compels him to take a treacherous journey through the Underground Railroad.Published in 2010, The Kitchen House became a grassroots bestseller. Fans connected so deeply to the book’s characters that the author, Kathleen Grissom, found herself being asked over and over “what happens next?” The wait is finally over.This new, stand-alone novel opens in 1830, and Jamie, who fled from the Virginian plantation he once called home, is passing in Philadelphia society as a wealthy white silversmith. After many years of striving, Jamie has achieved acclaim and security, only to discover that his aristocratic lover Caroline is pregnant. Before he can reveal his real identity to her, he learns that his beloved servant Pan has been captured and sold into slavery in the South. Pan’s father, to whom Jamie owes a great debt, pleads for Jamie’s help, and Jamie agrees, knowing the journey will take him perilously close to Tall Oakes and the ruthless slave hunter who is still searching for him. Meanwhile, Caroline’s father learns and exposes Jamie’s secret, and Jamie loses his home, his business, and finally Caroline.Heartbroken and with nothing to lose, Jamie embarks on a trip to a North Carolina plantation where Pan is being held with a former Tall Oakes slave named Sukey, who is intent on getting Pan to the Underground Railroad. Soon the three of them are running through the Great Dismal Swamp, the notoriously deadly hiding place for escaped slaves. Though they have help from those in the Underground Railroad, not all of them will make it out alive. ...more",
      "upc": "de4b403cb629a29f"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/5c/19/5c19785278eaa6bf984ce6659847abc3.jpg",
      "bookTitle": "Love, Lies and Spies",
      "bookPrice": "£20.55",
      "available": " In stock (12 available)",
      "bookDescription": "Juliana Telford is not your average nineteenth-century young lady. She’s much more interested in researching ladybugs than marriage, fashionable dresses, or dances. So when her father sends her to London for a season, she’s determined not to form any attachments. Instead, she plans to secretly publish their research.Spencer Northam is not the average young gentleman of lei Juliana Telford is not your average nineteenth-century young lady. She’s much more interested in researching ladybugs than marriage, fashionable dresses, or dances. So when her father sends her to London for a season, she’s determined not to form any attachments. Instead, she plans to secretly publish their research.Spencer Northam is not the average young gentleman of leisure he appears. He is actually a spy for the War Office, and is more focused on acing his first mission than meeting eligible ladies. Fortunately, Juliana feels the same, and they agree to pretend to fall for each other. Spencer can finally focus, until he is tasked with observing Juliana’s traveling companions . . . and Juliana herself. ...more",
      "upc": "9546d537fbf99eb6"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/b3/d9/b3d90aca157d5a250becc8b255a37251.jpg",
      "bookTitle": "A Paris Apartment",
      "bookPrice": "£39.01",
      "available": " In stock (12 available)",
      "bookDescription": "Bienvenue à Paris!When April Vogt's boss tells her about an apartment in the ninth arrondissement that has been discovered after being shuttered for the past seventy years, the Sotheby's continental furniture specialist does not hear the words “dust” or “rats” or “decrepit.” She hears Paris. She hears escape.Once in France, April quickly learns the apartment is not merely Bienvenue à Paris!When April Vogt's boss tells her about an apartment in the ninth arrondissement that has been discovered after being shuttered for the past seventy years, the Sotheby's continental furniture specialist does not hear the words “dust” or “rats” or “decrepit.” She hears Paris. She hears escape.Once in France, April quickly learns the apartment is not merely some rich hoarder's repository. Beneath the cobwebs and stale perfumed air is a goldmine, and not because of the actual gold (or painted ostrich eggs or mounted rhinoceros horns or bronze bathtub). First, there's a portrait by one of the masters of the Belle Epoque, Giovanni Boldini. And then there are letters and journals written by the very woman in the painting, Marthe de Florian. These documents reveal that she was more than a renowned courtesan with enviable decolletage. Suddenly April's quest is no longer about the bureaux plats and Louis-style armchairs that will fetch millions at auction. It's about discovering the story behind this charismatic woman.It's about discovering two women, actually.With the help of a salty (and annoyingly sexy) Parisian solicitor and the courtesan's private diaries, April tries to uncover the many secrets buried in the apartment. As she digs into Marthe's life, April can't help but take a deeper look into her own. Having left behind in the States a cheating husband, a family crisis about to erupt, and a career she's been using as the crutch to simply get by, she feels compelled to sort out her own life too. When the things she left bubbling back home begin to boil over, and Parisian delicacies beyond flaky pâtisseries tempt her better judgment, April knows that both she and Marthe deserve happy finales.Whether accompanied by croissants or champagne, this delectable debut novel depicts the Paris of the Belle Epoque and the present day with vibrant and stunning allure. Based on historical events, Michelle Gable's A Paris Apartment will entertain and inspire, as readers embrace the struggles and successes of two very unforgettable women. ...more",
      "upc": "63343e287971bb0c"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/c0/80/c080a1626edf581b780420db13e7b074.jpg",
      "bookTitle": "Lilac Girls",
      "bookPrice": "£17.28",
      "available": " In stock (11 available)",
      "bookDescription": "Inspired by the life of a real World War II heroine, this debut novel reveals a story of love, redemption, and secrets that were hidden for decades.New York socialite Caroline Ferriday has her hands full with her post at the French consulate and a new love on the horizon. But Caroline’s world is forever changed when Hitler’s army invades Poland in September 1939—and then s Inspired by the life of a real World War II heroine, this debut novel reveals a story of love, redemption, and secrets that were hidden for decades. New York socialite Caroline Ferriday has her hands full with her post at the French consulate and a new love on the horizon. But Caroline’s world is forever changed when Hitler’s army invades Poland in September 1939—and then sets its sights on France.   An ocean away from Caroline, Kasia Kuzmerick, a Polish teenager, senses her carefree youth disappearing as she is drawn deeper into her role as courier for the underground resistance movement. In a tense atmosphere of watchful eyes and suspecting neighbors, one false move can have dire consequences.   For the ambitious young German doctor, Herta Oberheuser, an ad for a government medical position seems her ticket out of a desolate life. Once hired, though, she finds herself trapped in a male-dominated realm of Nazi secrets and power.   The lives of these three women are set on a collision course when the unthinkable happens and Kasia is sent to Ravensbrück, the notorious Nazi concentration camp for women. Their stories cross continents—from New York to Paris, Germany, and Poland—as Caroline and Kasia strive to bring justice to those whom history has forgotten. ...more",
      "upc": "bade9943ee01b63f"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/ed/52/ed52651826bb23d853aead2753c9befc.jpg",
      "bookTitle": "The Constant Princess (The Tudor Court #1)",
      "bookPrice": "£16.62",
      "available": " In stock (7 available)",
      "bookDescription": "\"I am Catalina, Princess of Spain, daughter of the two greatest monarchs the world has ever known...and I will be Queen of England.\"Thus, bestselling author Philippa Gregory introduces one of her most unforgettable heroines: Katherine of Aragon. Known to history as the Queen who was pushed off her throne by Anne Boleyn, here is a Katherine the world has forgotten: the ench \"I am Catalina, Princess of Spain, daughter of the two greatest monarchs the world has ever known...and I will be Queen of England.\"Thus, bestselling author Philippa Gregory introduces one of her most unforgettable heroines: Katherine of Aragon. Known to history as the Queen who was pushed off her throne by Anne Boleyn, here is a Katherine the world has forgotten: the enchanting princess that all England loved. First married to Henry VIII's older brother, Arthur, Katherine's passion turns their arranged marriage into a love match; but when Arthur dies, the merciless English court and her ambitious parents -- the crusading King and Queen of Spain -- have to find a new role for the widow. Ultimately, it is Katherine herself who takes control of her own life by telling the most audacious lie in English history, leading her to the very pinnacle of power in England.Set in the rich beauty of Moorish Spain and the glamour of the Tudor court, The Constant Princess presents a woman whose constancy helps her endure betrayal, poverty, and despair, until the inevitable moment when she steps into the role she has prepared for all her life: Henry VIII's Queen, Regent, and commander of the English army in their greatest victory against Scotland. ...more",
      "upc": "24933c712f0bca2f"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/7a/b0/7ab00e6956f540bfe0018656d5bfe1e4.jpg",
      "bookTitle": "The Invention of Wings",
      "bookPrice": "£37.34",
      "available": " In stock (6 available)",
      "bookDescription": "Writing at the height of her narrative and imaginative gifts, Sue Monk Kidd presents a masterpiece of hope, daring, the quest for freedom, and the desire to have a voice in the world—and it is now the newest Oprah’s Book Club 2.0 selection.Hetty “Handful” Grimke, an urban slave in early nineteenth century Charleston, yearns for life beyond the suffocating walls that enclos Writing at the height of her narrative and imaginative gifts, Sue Monk Kidd presents a masterpiece of hope, daring, the quest for freedom, and the desire to have a voice in the world—and it is now the newest Oprah’s Book Club 2.0 selection.Hetty “Handful” Grimke, an urban slave in early nineteenth century Charleston, yearns for life beyond the suffocating walls that enclose her within the wealthy Grimke household. The Grimke’s daughter, Sarah, has known from an early age she is meant to do something large in the world, but she is hemmed in by the limits imposed on women.Kidd’s sweeping novel is set in motion on Sarah’s eleventh birthday, when she is given ownership of ten year old Handful, who is to be her handmaid. We follow their remarkable journeys over the next thirty five years, as both strive for a life of their own, dramatically shaping each other’s destinies and forming a complex relationship marked by guilt, defiance, estrangement and the uneasy ways of love.As the stories build to a riveting climax, Handful will endure loss and sorrow, finding courage and a sense of self in the process. Sarah will experience crushed hopes, betrayal, unrequited love, and ostracism before leaving Charleston to find her place alongside her fearless younger sister, Angelina, as one of the early pioneers in the abolition and women’s rights movements.Inspired by the historical figure of Sarah Grimke, Kidd goes beyond the record to flesh out the rich interior lives of all of her characters, both real and invented, including Handful’s cunning mother, Charlotte, who courts danger in her search for something better.This exquisitely written novel is a triumph of storytelling that looks with unswerving eyes at a devastating wound in American history, through women whose struggles for liberation, empowerment, and expression will leave no reader unmoved. ...more",
      "upc": "e6635f5b0a2c78db"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/58/b5/58b5730dd82cbcf6560cf0ab8b56cd9f.jpg",
      "bookTitle": "World Without End (The Pillars of the Earth #2)",
      "bookPrice": "£32.97",
      "available": " In stock (5 available)",
      "bookDescription": "Eighteen years after the publication of The Pillars of the Earth, Ken Follett has written the the long awaited sequel, World Without End. World Without End takes place in the same town of Kingsbridge, two centuries after the townspeople finished building the exquisite Gothic cathedral that was at the heart of The Pillars of the Earth. The cathedral and the priory are agai Eighteen years after the publication of The Pillars of the Earth, Ken Follett has written the the long awaited sequel, World Without End. World Without End takes place in the same town of Kingsbridge, two centuries after the townspeople finished building the exquisite Gothic cathedral that was at the heart of The Pillars of the Earth. The cathedral and the priory are again at the center of a web of love and hate, greed and pride, ambition and revenge, but this sequel stands on its own. This time, the men and women among an extraordinary cast of characters find themselves at a crossroad of new ideas -- about medicine, commerce, architecture, and justice. In a world where proponents of the old ways fiercely battle those with progressive minds, the intrigue and tension quickly reach a boiling point against the devastating backdrop of the greatest natural disaster ever to strike the human race: the Black Death. ...more",
      "upc": "2e5b4ff08a75fd02"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/b3/59/b35975c0df26c40964028a8ccabc9a91.jpg",
      "bookTitle": "The Passion of Dolssa",
      "bookPrice": "£28.32",
      "available": " In stock (4 available)",
      "bookDescription": "Dolssa is a young gentlewoman with uncanny gifts, on the run from an obsessed friar determined to burn her as a heretic for the passion she refuses to tame.Botille is a wily and charismatic peasant, a matchmaker running a tavern with her two sisters in a tiny seaside town.The year is 1241; the place, Provensa, what we now call Provence, France—a land still reeling from the Dolssa is a young gentlewoman with uncanny gifts, on the run from an obsessed friar determined to burn her as a heretic for the passion she refuses to tame.Botille is a wily and charismatic peasant, a matchmaker running a tavern with her two sisters in a tiny seaside town.The year is 1241; the place, Provensa, what we now call Provence, France—a land still reeling from the bloody crusades waged there by the Catholic Church and its northern French armies.When the matchmaker finds the mystic near death by a riverside, Botille takes Dolssa in and discovers the girl’s extraordinary healing power. But as the vengeful Friar Lucien hunts down his heretic, the two girls find themselves putting an entire village at the mercy of murderers. ...more",
      "upc": "011674f4a3834b8d"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/b1/5e/b15ec9da5c7b28e2d11347dd2e8c20e5.jpg",
      "bookTitle": "Girl With a Pearl Earring",
      "bookPrice": "£26.77",
      "available": " In stock (4 available)",
      "bookDescription": "With precisely 35 canvases to his credit, the Dutch painter Johannes Vermeer represents one of the great enigmas of 17th-century art. The meager facts of his biography have been gleaned from a handful of legal documents. Yet Vermeer's extraordinary paintings of domestic life, with their subtle play of light and texture, have come to define the Dutch golden age. His portrai With precisely 35 canvases to his credit, the Dutch painter Johannes Vermeer represents one of the great enigmas of 17th-century art. The meager facts of his biography have been gleaned from a handful of legal documents. Yet Vermeer's extraordinary paintings of domestic life, with their subtle play of light and texture, have come to define the Dutch golden age. His portrait of the anonymous Girl with a Pearl Earring has exerted a particular fascination for centuries--and it is this magnetic painting that lies at the heart of Tracy Chevalier's second novel of the same title.Girl with a Pearl Earring centers on Vermeer's prosperous Delft household during the 1660s. When Griet, the novel's quietly perceptive heroine, is hired as a servant, turmoil follows. First, the 16-year-old narrator becomes increasingly intimate with her master. Then Vermeer employs her as his assistant--and ultimately has Griet sit for him as a model. ...more",
      "upc": "5eff05e59f905a49"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/6e/22/6e22497cbecedef59be86d1328e4b044.jpg",
      "bookTitle": "Voyager (Outlander #3)",
      "bookPrice": "£21.07",
      "available": " In stock (3 available)",
      "bookDescription": "From the author of the breathtaking bestsellers Outlander and Dragonfly in Amber, the extraordinary saga continues.Their passionate encounter happened long ago by whatever measurement Claire Randall took. Two decades before, she had traveled back in time and into the arms of a gallant eighteenth-century Scot named Jamie Fraser. Then she returned to her own century to bear From the author of the breathtaking bestsellers Outlander and Dragonfly in Amber, the extraordinary saga continues.Their passionate encounter happened long ago by whatever measurement Claire Randall took. Two decades before, she had traveled back in time and into the arms of a gallant eighteenth-century Scot named Jamie Fraser. Then she returned to her own century to bear his child, believing him dead in the tragic battle of Culloden. Yet his memory has never lessened its hold on her... and her body still cries out for him in her dreams.Then Claire discovers that Jamie survived. Torn between returning to him and staying with their daughter in her own era, Claire must choose her destiny. And as time and space come full circle, she must find the courage to face the passion and pain awaiting her...the deadly intrigues raging in a divided Scotland... and the daring voyage into the dark unknown that can reunite or forever doom her timeless love. ...more",
      "upc": "7feac4000cbc5859"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/15/59/155942710c3ae4bd4ed622df9a999b99.jpg",
      "bookTitle": "The Red Tent",
      "bookPrice": "£35.66",
      "available": " In stock (3 available)",
      "bookDescription": "Her name is Dinah. In the Bible, her life is only hinted at in a brief and violent detour within the more familiar chapters of the Book of Genesis that are about her father, Jacob, and his dozen sons. Told in Dinah's voice, this novel reveals the traditions and turmoils of ancient womanhood--the world of the red tent. It begins with the story of her mothers--Leah, Rachel, Her name is Dinah. In the Bible, her life is only hinted at in a brief and violent detour within the more familiar chapters of the Book of Genesis that are about her father, Jacob, and his dozen sons. Told in Dinah's voice, this novel reveals the traditions and turmoils of ancient womanhood--the world of the red tent. It begins with the story of her mothers--Leah, Rachel, Zilpah, and Bilhah--the four wives of Jacob. They love Dinah and give her gifts that sustain her through a hard-working youth, a calling to midwifery, and a new home in a foreign land. Dinah's story reaches out from a remarkable period of early history and creates an intimate connection with the past. Deeply affecting, The Red Tent combines rich storytelling with a valuable achievement in modern fiction: a new view of biblical women's society. ...more",
      "upc": "3c456328b04a8ee8"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/1c/e4/1ce4c2573d65ebdc3c85d9a6592d57b1.jpg",
      "bookTitle": "The Last Painting of Sara de Vos",
      "bookPrice": "£55.55",
      "available": " In stock (3 available)",
      "bookDescription": "This is what we long for: the profound pleasure of being swept into vivid new worlds, worlds peopled by characters so intriguing and real that we can't shake them, even long after the reading's done. In his earlier, award-winning novels, Dominic Smith demonstrated a gift for coaxing the past to life. Now, in The Last Painting of Sara de Vos, he deftly bridges the historica This is what we long for: the profound pleasure of being swept into vivid new worlds, worlds peopled by characters so intriguing and real that we can't shake them, even long after the reading's done. In his earlier, award-winning novels, Dominic Smith demonstrated a gift for coaxing the past to life. Now, in The Last Painting of Sara de Vos, he deftly bridges the historical and the contemporary, tracking a collision course between a rare landscape by a female Dutch painter of the golden age, an inheritor of the work in 1950s Manhattan, and a celebrated art historian who painted a forgery of it in her youth.In 1631, Sara de Vos is admitted as a master painter to the Guild of St. Luke's in Holland, the first woman to be so recognized. Three hundred years later, only one work attributed to de Vos is known to remain--a haunting winter scene, At the Edge of a Wood, which hangs over the bed of a wealthy descendant of the original owner. An Australian grad student, Ellie Shipley, struggling to stay afloat in New York, agrees to paint a forgery of the landscape, a decision that will haunt her. Because now, half a century later, she's curating an exhibit of female Dutch painters, and both versions threaten to arrive. As the three threads intersect, The Last Painting of Sara de Vos mesmerizes while it grapples with the demands of the artistic life, showing how the deceits of the past can forge the present. ...more",
      "upc": "476c7972e9b41891"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/98/e3/98e3925e5e6a66acf2cde918fc147205.jpg",
      "bookTitle": "The Guernsey Literary and Potato Peel Pie Society",
      "bookPrice": "£49.53",
      "available": " In stock (3 available)",
      "bookDescription": "“ I wonder how the book got to Guernsey? Perhaps there is some sort of secret homing instinct in books that brings them to their perfect readers.” January 1946: London is emerging from the shadow of the Second World War, and writer Juliet Ashton is looking for her next book subject. Who could imagine that she would find it in a letter from a man she’s never met, a native o “ I wonder how the book got to Guernsey? Perhaps there is some sort of secret homing instinct in books that brings them to their perfect readers.” January 1946: London is emerging from the shadow of the Second World War, and writer Juliet Ashton is looking for her next book subject. Who could imagine that she would find it in a letter from a man she’s never met, a native of the island of Guernsey, who has come across her name written inside a book by Charles Lamb….As Juliet and her new correspondent exchange letters, Juliet is drawn into the world of this man and his friends—and what a wonderfully eccentric world it is. The Guernsey Literary and Potato Peel Pie Society—born as a spur-of-the-moment alibi when its members were discovered breaking curfew by the Germans occupying their island—boasts a charming, funny, deeply human cast of characters, from pig farmers to phrenologists, literature lovers all.Juliet begins a remarkable correspondence with the society’s members, learning about their island, their taste in books, and the impact the recent German occupation has had on their lives. Captivated by their stories, she sets sail for Guernsey, and what she finds will change her forever.Written with warmth and humor as a series of letters, this novel is a celebration of the written word in all its guises, and of finding connection in the most surprising ways. ...more",
      "upc": "4a0a276409968a73"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/15/ea/15eaabd188af8916c4a37d135f7b8952.jpg",
      "bookTitle": "Girl in the Blue Coat",
      "bookPrice": "£46.83",
      "available": " In stock (3 available)",
      "bookDescription": "Amsterdam, 1943. Hanneke spends her days finding and delivering sought-after black market goods to paying customers, nights hiding the true nature of her work from her concerned parents, and every waking moment mourning her boyfriend, who was killed on the Dutch front lines when the German army invaded. Her illegal work keeps her family afloat, and Hanneke also likes to th Amsterdam, 1943. Hanneke spends her days finding and delivering sought-after black market goods to paying customers, nights hiding the true nature of her work from her concerned parents, and every waking moment mourning her boyfriend, who was killed on the Dutch front lines when the German army invaded. Her illegal work keeps her family afloat, and Hanneke also likes to think of it as a small act of rebellion against the Nazis.On a routine delivery, a client asks Hanneke for help. Expecting to hear that Mrs. Janssen wants meat or kerosene, Hanneke is shocked by the older woman’s frantic plea to find a person: a Jewish teenager Mrs. Janssen had been hiding, who has vanished without a trace from a secret room. Hanneke initially wants nothing to do with such a dangerous task but is ultimately drawn into a web of mysteries and stunning revelations—where the only way out is through.Beautifully written, intricately plotted, and meticulously researched, Girl in the Blue Coat is an extraordinary, unforgettable story of bravery, grief, and love in impossible times. ...more",
      "upc": "41fc5dce044f16f5"
    }
  ],
  "Sequential Art": [
    {
      "imageUrl": "https://books.toscrape.com/media/cache/97/27/97275841c81e66d53bf9313cba06f23e.jpg",
      "bookTitle": "Scott Pilgrim's Precious Little Life (Scott Pilgrim #1)",
      "bookPrice": "£52.29",
      "available": " In stock (19 available)",
      "bookDescription": "Scott Pilgrim's life is totally sweet. He's 23 years old, he's in a rockband, he's \"between jobs\" and he's dating a cute high school girl. Nothing could possibly go wrong, unless a seriously mind-blowing, dangerously fashionable, rollerblading delivery girl named Ramona Flowers starts cruising through his dreams and sailing by him at parties. Will Scott's awesome life get Scott Pilgrim's life is totally sweet. He's 23 years old, he's in a rockband, he's \"between jobs\" and he's dating a cute high school girl. Nothing could possibly go wrong, unless a seriously mind-blowing, dangerously fashionable, rollerblading delivery girl named Ramona Flowers starts cruising through his dreams and sailing by him at parties. Will Scott's awesome life get turned upside-down? Will he have to face Ramona's seven evil ex-boyfriends in battle? The short answer is yes. The long answer is Scott Pilgrim, Volume 1: Scott Pilgrim's Precious Little Life ...more",
      "upc": "3b1c02bac2a429e6"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/8b/ab/8bab133ec9f8248a8d5f5ea5c09d0f56.jpg",
      "bookTitle": "Tsubasa: WoRLD CHRoNiCLE 2 (Tsubasa WoRLD CHRoNiCLE #2)",
      "bookPrice": "£16.28",
      "available": " In stock (16 available)",
      "bookDescription": "DUAL WORLDS, DUAL SIGHTS In the land of Nirai Kanai, there are two realms, one that is the \"outside\" world, and another that is \"inside\" and hidden from the rest of reality. At the request of the holy Himegami, Syaoran ventures into this inside realm to investigate an anomaly, but what he sees there is very different from what Fai and Kurogane see. What does this discrepa DUAL WORLDS, DUAL SIGHTS   In the land of Nirai Kanai, there are two realms, one that is the \"outside\" world, and another that is \"inside\" and hidden from the rest of reality. At the request of the holy Himegami, Syaoran ventures into this inside realm to investigate an anomaly, but what he sees there is very different from what Fai and Kurogane see. What does this discrepancy mean, and what can they do to overcome it?! ...more",
      "upc": "09555be379ad9253"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/ee/43/ee4364a59d66bafb1b3264419ab3ed9e.jpg",
      "bookTitle": "This One Summer",
      "bookPrice": "£19.49",
      "available": " In stock (16 available)",
      "bookDescription": "Every summer, Rose goes with her mom and dad to a lake house in Awago Beach. It's their getaway, their refuge. Rosie's friend Windy is always there, too, like the little sister she never had. But this summer is different. Rose's mom and dad won't stop fighting, and when Rose and Windy seek a distraction from the drama, they find themselves with a whole new set of problems. Every summer, Rose goes with her mom and dad to a lake house in Awago Beach. It's their getaway, their refuge. Rosie's friend Windy is always there, too, like the little sister she never had. But this summer is different. Rose's mom and dad won't stop fighting, and when Rose and Windy seek a distraction from the drama, they find themselves with a whole new set of problems. It's a summer of secrets and sorrow and growing up, and it's a good thing Rose and Windy have each other.In This One Summer two stellar creators redefine the teen graphic novel. Cousins Mariko and Jillian Tamaki, the team behind Skim, have collaborated on this gorgeous, heartbreaking, and ultimately hopeful story about a girl on the cusp of her teen age — a story of renewal and revelation. ...more",
      "upc": "51653ef291ab7ddc"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/19/de/19deee0778c2406da04a4dd0ea09188f.jpg",
      "bookTitle": "The Nameless City (The Nameless City #1)",
      "bookPrice": "£38.16",
      "available": " In stock (16 available)",
      "bookDescription": "Every nation that invades the City gives it a new name. But before long, new invaders arrive and the City changes hands once again. The natives don't let themselves get caught up in the unending wars. To them, their home is the Nameless City, and those who try to name it are forever outsiders.Kaidu is one such outsider. He's a Dao born and bred--a member of the latest occu Every nation that invades the City gives it a new name. But before long, new invaders arrive and the City changes hands once again. The natives don't let themselves get caught up in the unending wars. To them, their home is the Nameless City, and those who try to name it are forever outsiders.Kaidu is one such outsider. He's a Dao born and bred--a member of the latest occupying nation. Rat is a native of the Nameless City. At first, she hates Kai for everything he stands for, but his love of his new home may be the one thing that can bring these two unlikely friends together. Let's hope so, because the fate of the Nameless City rests in their hands. ...more",
      "upc": "7d385d34d12e60ff"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/60/3c/603c8f3dd299efe67616a53e5bfb1d03.jpg",
      "bookTitle": "Saga, Volume 5 (Saga (Collected Editions) #5)",
      "bookPrice": "£51.04",
      "available": " In stock (16 available)",
      "bookDescription": "Multiple storylines collide in this cosmos-spanning new volume. While Gwendolyn and Lying Cat risk everything to find a cure for The Will, Marko makes an uneasy alliance with Prince Robot IV to find their missing children, who are trapped on a strange world with terrifying new enemies. Collects Saga #25-30.",
      "upc": "53a3d11bb568cc8b"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/d5/d0/d5d015a9cf899301cce5d1a629bdd974.jpg",
      "bookTitle": "Rat Queens, Vol. 3: Demons (Rat Queens (Collected Editions) #11-15)",
      "bookPrice": "£50.40",
      "available": " In stock (16 available)",
      "bookDescription": "Having survived the end of the world, the Queens follow Hannah back to where it all began: Mage University. A long perilous journey awaits the Rat Queens as they attempt to find out what happened to Hannah's father while battling their own demons. Collects RAT QUEENS #11-15",
      "upc": "c82a3e358c773c73"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/6c/8f/6c8ffe949fb650ba60eff25be1692881.jpg",
      "bookTitle": "Princess Jellyfish 2-in-1 Omnibus, Vol. 01 (Princess Jellyfish 2-in-1 Omnibus #1)",
      "bookPrice": "£13.61",
      "available": " In stock (16 available)",
      "bookDescription": "THE LONG-AWAITED STORY OF FANGIRLS TAKING ON TOKYO!Special large-size 2-in-1 edition of over 400 pages!\"One of the best anime and manga for beginners. Enthusiasm - geeky and otherwise - is power in Princess Jellyfish. Enthusiasm saves the day and paves the road to the future.\" - Kotaku\"Princess Jellyfish's ambition is simple: to tell a delightful story in a delightful way. THE LONG-AWAITED STORY OF FANGIRLS TAKING ON TOKYO!Special large-size 2-in-1 edition of over 400 pages!\"One of the best anime and manga for beginners. Enthusiasm - geeky and otherwise - is power in Princess Jellyfish. Enthusiasm saves the day and paves the road to the future.\" - Kotaku\"Princess Jellyfish's ambition is simple: to tell a delightful story in a delightful way... It's a pretty deadly one-two punch.\" - Anime News Network\"Loaded with heart, soul, humor and insight.\" - About.comSTINGING BEAUTY Tsukimi Kurashita has a strange fascination with jellyfish. She’s loved them from a young age and has carried that love with her to her new life in the big city of Tokyo. There, she resides in Amamizukan, a safe-haven for girl geeks who regularly gush over a range of things from trains to Japanese dolls. However, a chance meeting at a pet shop has Tsukimi crossing paths with one of the things that the residents of Amamizukan have been desperately trying to avoid—a beautiful and fashionable woman! But there’s much more to this woman than her trendy clothes! This odd encounter is only the beginning of a new and unexpected path for Tsukimi and her friends. ...more",
      "upc": "0fa6dceead7ce47a"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/6f/7b/6f7b3b8445b943f4ff7426360daefb88.jpg",
      "bookTitle": "Pop Gun War, Volume 1: Gift",
      "bookPrice": "£18.97",
      "available": " In stock (16 available)",
      "bookDescription": "\"Pop Gun War is about childhood, self-discovery, oppression, guilt, dreams, loneliness, whatever. It is more about a feeling you, the reader, get from the story rather than a typical narrative. If you wanted to get literal, it is about an inner city boy, Sinclair, who discovers a pair of discarded angel wings. With these wings, Sinclair flies around the city and gets into \"Pop Gun War is about childhood, self-discovery, oppression, guilt, dreams, loneliness, whatever. It is more about a feeling you, the reader, get from the story rather than a typical narrative. If you wanted to get literal, it is about an inner city boy, Sinclair, who discovers a pair of discarded angel wings. With these wings, Sinclair flies around the city and gets into adventures.\" - Farel Dalrymple, series creator From Publishers Weekly: Collecting the first five issues of Dalrymple's acclaimed comic book series Pop Gun War, this book provides a capsule look at Dalrymple's vision of urban fantasy. Set in New York, his stories follow characters with wings, talking fish, giants, dwarves and other fantastical acquaintances and ideas. At the center of it all is a boy named Sinclair, who acquires a set of wings when a tattooed, disgruntled angel pays to have them cut off. Sinclair, a lonely kid prone to bowties and being teased, sets off on a series of encounters across the city. His older sister, a singer in a rock band, is an inspiration and worry; a homeless man of unknown powers and origins joins him; and a band of youths pursue him. Dalrymple renders this gang of eccentrics and mystics in a loose but realistic pen and ink style highly dynamic and tailor-made for depicting New York's teeming city streets. He has a flair for the dramatic as well scenes of Sinclair flying, or of a giant walking the streets, are genuinely affecting, while seeming completely natural and brings to life a subtle kind of cartoon surrealism. The story meanders a bit, and it's not always clear where it's headed, but the fun of Pop Gun War is in its vivid characters and details. It is a fine debut, reminiscent of DC Comics's Vertigo line, with which it should sit comfortably on bookstores' and adventurous readers' shelves. ...more",
      "upc": "e80f8e518b300dfe"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/71/0c/710cdaa148f10aac35c27bb93b4f532e.jpg",
      "bookTitle": "Patience",
      "bookPrice": "£10.16",
      "available": " In stock (16 available)",
      "bookDescription": "Patience is a psychedelic science-fiction love story, veering with uncanny precision from violent destruction to deeply personal tenderness in a way that is both quintessentially “Clowesian” and utterly unique in the author’s body of work. This 180-page, full-color original graphic novel affords Clowes the opportunity to draw some of the most exuberant and breathtaking pag Patience is a psychedelic science-fiction love story, veering with uncanny precision from violent destruction to deeply personal tenderness in a way that is both quintessentially “Clowesian” and utterly unique in the author’s body of work. This 180-page, full-color original graphic novel affords Clowes the opportunity to draw some of the most exuberant and breathtaking pages of his life, and to tell his most suspenseful, surprising and affecting story yet. ...more",
      "upc": "9429b4d59c537af5"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/0c/8a/0c8ae80b592bc1b4c555d6b29d1cfa28.jpg",
      "bookTitle": "Outcast, Vol. 1: A Darkness Surrounds Him (Outcast #1)",
      "bookPrice": "£15.44",
      "available": " In stock (16 available)",
      "bookDescription": "NEW HORROR SERIES FROM THE WALKING DEAD CREATOR ROBERT KIRKMAN! Kyle Barnes has been plagued by demonic possession all his life and now he needs answers. Unfortunately, what he uncovers along the way could bring about the end of life on Earth as we know it. Collects OUTCAST BY KIRKMAN & AZACETA #1-6.",
      "upc": "889139b8e9c4cb36"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/33/0b/330bf57e3f2e70548f87d39cb956f7eb.jpg",
      "bookTitle": "orange: The Complete Collection 1 (orange: The Complete Collection #1)",
      "bookPrice": "£48.41",
      "available": " In stock (16 available)",
      "bookDescription": "A Plea From the FutureOn the day that Naho begins 11th grade, she recieves a letter from herself ten years in the future. At first, she writes it off as a prank, but as the letter’s predictions come true one by one Naho realizes that the letter might be the real deal. Her future self tells Naho that a new transfer student, a boy named Kakeru, will soon join her class. The A Plea From the FutureOn the day that Naho begins 11th grade, she recieves a letter from herself ten years in the future. At first, she writes it off as a prank, but as the letter’s predictions come true one by one Naho realizes that the letter might be the real deal. Her future self tells Naho that a new transfer student, a boy named Kakeru, will soon join her class. The letter begs Naho to watch over him, saying that only Naho can save Kakeru from a terrible future. Who is this mystery boy, and can Naho save him from his destiny? The heart-wrenching sci-fi romance that has over million copies in print in Japan! ...more",
      "upc": "11809b1d323b3057"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/67/f8/67f83a06f77d0ff3b06cb8ac04839422.jpg",
      "bookTitle": "Lumberjanes, Vol. 2: Friendship to the Max (Lumberjanes #5-8)",
      "bookPrice": "£46.91",
      "available": " In stock (16 available)",
      "bookDescription": "What a mystery!Jo, April, Mal, Molly, and Ripley are not your average campers and Miss Qiunzella Thiskwin Penniquiqul Thistle Crumpet's Camp for Hardcore Lady-Types is not your average summer camp. Between the river monsters, magic, and the art of friendship bracelets, this summer is only just beginning. Join the Lumberjanes as they take on raptors and a sibling rivalry th What a mystery!Jo, April, Mal, Molly, and Ripley are not your average campers and Miss Qiunzella Thiskwin Penniquiqul Thistle Crumpet's Camp for Hardcore Lady-Types is not your average summer camp. Between the river monsters, magic, and the art of friendship bracelets, this summer is only just beginning. Join the Lumberjanes as they take on raptors and a sibling rivalry that only myths are made of.This New York Times bestseller and Eisner Award-nominated series is written by awesome all-star Noelle Stevenson and brilliant newcomer Grace Ellis, and illustrated by the tremendously talented Brooke Allen.Lumberjanes, Vol. 2: Friendship to the Max includes issues 5-8 and the first fourteen pages of Giant Days, Vol. 1 by John Allison. ...more",
      "upc": "460089f796fb3f82"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/1c/78/1c78cb31ededc4c662857cf65bd1619d.jpg",
      "bookTitle": "Lumberjanes, Vol. 1: Beware the Kitten Holy (Lumberjanes #1-4)",
      "bookPrice": "£45.61",
      "available": " In stock (16 available)",
      "bookDescription": "FRIENDSHIP TO THE MAX!At Miss Qiunzilla Thiskwin Penniquiqul Thistle Crumpet's camp for hard-core lady-types, things are not what they seem. Three-eyed foxes. Secret caves. Anagrams. Luckily, Jo, April, Mal, Molly, and Ripley are five rad, butt-kicking best pals determined to have an awesome summer together... And they're not gonna let a magical quest or an array of supern FRIENDSHIP TO THE MAX!At Miss Qiunzilla Thiskwin Penniquiqul Thistle Crumpet's camp for hard-core lady-types, things are not what they seem. Three-eyed foxes. Secret caves. Anagrams. Luckily, Jo, April, Mal, Molly, and Ripley are five rad, butt-kicking best pals determined to have an awesome summer together... And they're not gonna let a magical quest or an array of supernatural critters get in their way! The mystery keeps getting bigger, and it all begins here. Collects Lumberjanes No. 1-4. ...more",
      "upc": "b6ee99bcf06fc91f"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/d6/9b/d69b7020c4210e12882ffca0428919a2.jpg",
      "bookTitle": "Lumberjanes Vol. 3: A Terrible Plan (Lumberjanes #9-12)",
      "bookPrice": "£19.92",
      "available": " In stock (16 available)",
      "bookDescription": "This New York Times Bestselling series continues with Jo, April, Mal, Molly, and Ripley as they take on everything that goes bump in the night. From scary stories to magical portals that lead to a land untouched by time, it's definitely not your average summer. (Lumberjanes #9-12)",
      "upc": "57e5a4d515c8ce44"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/58/e2/58e2097169e92a95d973da420ce7cc98.jpg",
      "bookTitle": "I Hate Fairyland, Vol. 1: Madly Ever After (I Hate Fairyland (Compilations) #1-5)",
      "bookPrice": "£29.17",
      "available": " In stock (16 available)",
      "bookDescription": "From superstar writer and artist Skottie Young (Rocket Raccoon, Wizard of OZ, Fortunately, The Milk), comes the first volume of an all-new series of adventure and mayhem. An Adventure Time/Alice in Wonderland-style epic that smashes it's cute little face against grown-up, Tank Girl/Deadpool-esque violent madness. Follow Gert, a forty year old woman stuck in a six year olds From superstar writer and artist Skottie Young (Rocket Raccoon, Wizard of OZ, Fortunately, The Milk), comes the first volume of an all-new series of adventure and mayhem. An Adventure Time/Alice in Wonderland-style epic that smashes it's cute little face against grown-up, Tank Girl/Deadpool-esque violent madness. Follow Gert, a forty year old woman stuck in a six year olds body who has been stuck in the magical world of Fairyland for nearly thirty years. Join her and her giant battle-axe on a delightfully blood soaked journey to see who will survive the girl who HATES FAIRYLAND. Collecting Issues #1-5 for only $9.99. \"Skottie Young is an Eisner Award-Winning, New York Times Bestselling cartoonist who has been making comics and children's books for over fifteen years. Books such as Rocket Raccoon, the Wizard of Oz graphic novels, Little Marvel and Fortunately, The Milk have made him a fan favorite, critically-aclaimed writer and artist. Jean-Francios Beaulieu is the colorist behind the award-winning Wizard of OZ graphic graphic novels and has worked with Skottie Young for over ten years. Nate Piekos is an award-winning letter and designer who has created some of the industry's most popular fons and has used them to letter comic books for Marvel, DC, Oni Press, Dark Horse and many more.\" ...more",
      "upc": "8d4eefad7a2b3915"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/f7/4d/f74db5141becf01083abc03c078f4922.jpg",
      "bookTitle": "I am a Hero Omnibus Volume 1",
      "bookPrice": "£54.63",
      "available": " In stock (16 available)",
      "bookDescription": "The zombie apocalypse has never been more surreal! A mentally unhinged manga artist witnesses the beginning of a zombie outbreak in Tokyo, and he's certain of only two things: he's destined to be the city's hero, and he possesses something very rare in Japan--an actual firearm! Kengo Hanazawa's award-winning series comes to Dark Horse, and this realistically-drawn internat The zombie apocalypse has never been more surreal! A mentally unhinged manga artist witnesses the beginning of a zombie outbreak in Tokyo, and he's certain of only two things: he's destined to be the city's hero, and he possesses something very rare in Japan--an actual firearm! Kengo Hanazawa's award-winning series comes to Dark Horse, and this realistically-drawn international bestseller takes us from initial small battles for survival to a huge, body-horror epidemic that threatens all of humanity! These special omnibus volumes will collect two of the original Japanese books into each Dark Horse edition and include all of the color pages.\"Probably the greatest zombie manga ever.\" --Jason Thompson (Manga: The Complete Guide) ...more",
      "upc": "1c89ae5bb804e4de"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/d0/6f/d06ff4e3b9daf93b18bb21f1af19b5eb.jpg",
      "bookTitle": "Giant Days, Vol. 2 (Giant Days #5-8)",
      "bookPrice": "£22.11",
      "available": " In stock (16 available)",
      "bookDescription": "Susan, Esther, and Daisy started at university three weeks ago and became fast friends. Now, away from home for the first time, all three want to reinvent themselves. But in the face of hand-wringing boys, “personal experimentation,” holiday balls, nu-chauvinism, and the willful, unwanted intrusion of “academia,” they may be lucky just to make it to spring alive. Giant Day Susan, Esther, and Daisy started at university three weeks ago and became fast friends. Now, away from home for the first time, all three want to reinvent themselves. But in the face of hand-wringing boys, “personal experimentation,” holiday balls, nu-chauvinism, and the willful, unwanted intrusion of “academia,” they may be lucky just to make it to spring alive. Giant Days , the comedic slice-of-life series from creator John Allison (Bad Machinery, Scary Go Round) and artist Lissa Treiman, has graduated to a second volume. ...more",
      "upc": "f2df3bb043a8abb0"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/ce/39/ce3942d9a10b6a17805136ace7c140fa.jpg",
      "bookTitle": "Danganronpa Volume 1",
      "bookPrice": "£51.99",
      "available": " In stock (16 available)",
      "bookDescription": "Each year, the elite Hope's Peak Academy selects only the most gifted and talented students to enroll...plus one ordinary student, chosen by lottery. Makoto Naegi was that lucky person--or so he thought! When he shows up for class, he finds the elite students are a bizarre cast of oddballs under the ruthless authority of a robot teddy bear principal, Monokuma. The bear lay Each year, the elite Hope's Peak Academy selects only the most gifted and talented students to enroll...plus one ordinary student, chosen by lottery. Makoto Naegi was that lucky person--or so he thought! When he shows up for class, he finds the elite students are a bizarre cast of oddballs under the ruthless authority of a robot teddy bear principal, Monokuma. The bear lays down the school rules: the only way out of Hope's Peak is to not only murder another student...but get away with it, as every murder is followed by a tribunal where the surviving students cross-examine each other!Inspired by the Danganronpa videogame series and based on the anime of the same name, the Danganropa manga is a quirky, fun, weird, and dynamic take on the high school Battle Royale genre. ...more",
      "upc": "09b6cc87e62c2c58"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/ed/a5/eda54d1bfcdd39488013f7aae1eaf659.jpg",
      "bookTitle": "Codename Baboushka, Volume 1: The Conclave of Death",
      "bookPrice": "£36.72",
      "available": " In stock (16 available)",
      "bookDescription": "\"What if the sexy Russian femme fatale was actually the main character?\" Mysterious young heiress Contessa Annika Malikova has been part of Manhattan high society for several years... but if they knew the truth, her dinner companions would faint! The white-haired Contessa is in fact the notorious criminal \"BABOUSHKA\" -- a former Moscow gang leader, now living in exile! But \"What if the sexy Russian femme fatale was actually the main character?\" Mysterious young heiress Contessa Annika Malikova has been part of Manhattan high society for several years... but if they knew the truth, her dinner companions would faint! The white-haired Contessa is in fact the notorious criminal \"BABOUSHKA\" -- a former Moscow gang leader, now living in exile! But Baboushka's retirement is about to be shattered, as the US government has somehow discovered her true identity, and blackmails her into working for them! Now she must infiltrate a secret conclave of global crime lords, on a cruise liner, to retrieve information for the Americans. But nobody reckoned on the boat being hijacked by pirates... Suitable for teens and up, CODENAME BABOUSHKA is an action-packed modern pulp spy thriller from writer ANTONY JOHNSTON (THE FUSE, THE COLDEST CITY, ALEX RIDER) and artist SHARI CHANKHAMMA (THE FUSE, SHELTERED, KILL SHAKESPEARE), filled with glamour, guns, exotic locations, guns, explosions, high-kicks, and did we mention guns? \"An ass-kicking spy heroine who will appeal to fans of Marvel's Black Widow.\"- The AV Club \"There are literally six different amazing comics all within this one series\"- Comics Alliance \"Codename Baboushka takes a more female-positive look at the James Bond-esque role. Fun, fast-paced action. Female assassin done right!\"- Dark Side Comics \"Johnston's exiled Russian heiress, former organized crime lord and deadly agent bursts out of the page and grabs the reader with both hands in a deadly grip of hot action and cold-hearted kills.\"- Jersey Journal THE CONCLAVE OF DEATH collects Baboushka's first 5-issue mission -- watch out for her next assignment, GHOST STATION ZERO, in 2016! \"Antony Johnston is an award-winning, New York Times bestselling author of graphic novels, video games, and books. His graphic novel THE COLDEST CITY is being adapted into a film starring Charlize Theron. His epic series WASTELAND is one of only a handful of such longform comic stories in the medium. His first video game, DEAD SPACE, redefined the survival horror genre. ...more",
      "upc": "8754c83ab2a7ae71"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/7a/67/7a671ecf69cdcd2ea9ebe85da1b5585f.jpg",
      "bookTitle": "Camp Midnight",
      "bookPrice": "£17.08",
      "available": " In stock (16 available)",
      "bookDescription": "Ben 10 and Big Hero 6 creator Steven T. Seagle returns to comics with New Yorker Magazine cartoonist Jason Adam Katzenstein for a new graphic novel! Reluctant Skye is accidentally sent to the wrong summer camp. Not wanting to please her \"step monster,\" Skye is dead-set on not fitting in. That won't be a problem, as everyone at Camp Midnight-with the exception of fellow cam Ben 10 and Big Hero 6 creator Steven T. Seagle returns to comics with New Yorker Magazine cartoonist Jason Adam Katzenstein for a new graphic novel! Reluctant Skye is accidentally sent to the wrong summer camp. Not wanting to please her \"step monster,\" Skye is dead-set on not fitting in. That won't be a problem, as everyone at Camp Midnight-with the exception of fellow camper and fast-friend Mia-is a full-fledged monster! The perfect book for fans of Raina Telgemeier's \"Smile, \" but wish it had more bowls of gooey eyeballs. ...more",
      "upc": "7b599c8bfcdd8d30"
    }
  ],
  "Classics": [
    {
      "imageUrl": "https://books.toscrape.com/media/cache/f1/78/f17805e88aed31aae352ab250b2a379d.jpg",
      "bookTitle": "The Secret Garden",
      "bookPrice": "£15.08",
      "available": " In stock (5 available)",
      "bookDescription": "When orphaned Mary Lennox comes to live at her uncle's great house on the Yorkshire Moors, she finds it full of secrets. The mansion has nearly one hundred rooms, and her uncle keeps himself locked up. And at night, she hears the sound of crying down one of the long corridors.The gardens surrounding the large property are Mary's only escape. Then, Mary discovers a secret g When orphaned Mary Lennox comes to live at her uncle's great house on the Yorkshire Moors, she finds it full of secrets. The mansion has nearly one hundred rooms, and her uncle keeps himself locked up. And at night, she hears the sound of crying down one of the long corridors.The gardens surrounding the large property are Mary's only escape. Then, Mary discovers a secret garden, surrounded by walls and locked with a missing key. One day, with the help of two unexpected companions, she discovers a way in. Is everything in the garden dead, or can Mary bring it back to life? ...more",
      "upc": "abbb492978ff656d"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/9b/33/9b33c3c40c8d27054a3edf96cbf6a2fb.jpg",
      "bookTitle": "The Metamorphosis",
      "bookPrice": "£28.58",
      "available": " In stock (5 available)",
      "bookDescription": "As Gregor Samsa awoke one morning from uneasy dreams he found himself transformed in his bed into a gigantic insect. He was laying on his hard, as it were armor-plated, back and when he lifted his head a little he could see his domelike brown belly divided into stiff arched segments on top of which the bed quilt could hardly keep in position and was about to slide off comp As Gregor Samsa awoke one morning from uneasy dreams he found himself transformed in his bed into a gigantic insect. He was laying on his hard, as it were armor-plated, back and when he lifted his head a little he could see his domelike brown belly divided into stiff arched segments on top of which the bed quilt could hardly keep in position and was about to slide off completely. His numerous legs, which were pitifully thin compared to the rest of his bulk, waved helplessly before his eyes.\" With this startling, bizarre, yet surprisingly funny first opening, Kafka begins his masterpiece, The Metamorphosis. It is the story of a young man who, transformed overnight into a giant beetle-like insect, becomes an object of disgrace to his family, an outsider in his own home, a quintessentially alienated man. A harrowing -- though absurdly comic -- meditation on human feelings of inadequacy, guilt, and isolation, The Metamorphosis has taken its place as one of the most widely read and influential works of twentieth-century fiction. As W.H. Auden wrote, \"Kafka is important to us because his predicament is the predicament of modern man.\" ...more",
      "upc": "93379e3a2072a01b"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/91/2a/912acfe6ee354d9d9bf3c1fa517c4252.jpg",
      "bookTitle": "The Pilgrim's Progress",
      "bookPrice": "£50.26",
      "available": " In stock (4 available)",
      "bookDescription": "Often rated as important as the Bible as a Christian document, this famous story of man's progress through life in search of salvation remains one of the most entertaining allegories of faith ever written. Set against realistic backdrops of town and country, the powerful drama of the pilgrim's trials and temptations follows him in his harrowing journey to the Celestial Cit Often rated as important as the Bible as a Christian document, this famous story of man's progress through life in search of salvation remains one of the most entertaining allegories of faith ever written. Set against realistic backdrops of town and country, the powerful drama of the pilgrim's trials and temptations follows him in his harrowing journey to the Celestial City.Along a road filled with monsters and spiritual terrors, Christian confronts such emblematic characters as Worldly Wiseman, Giant Despair, Talkative, Ignorance, and the demons of the Valley of the Shadow of Death. But he is also joined by Hopeful and Faithful.An enormously influential 17th-century classic, universally known for its simplicity, vigor, and beauty of language, The Pilgrim's Progress remains one of the most widely read books in the English language. ...more",
      "upc": "6053ddf69c967d5f"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/9d/fe/9dfe2a73c6a1a1c09927c904de641ebf.jpg",
      "bookTitle": "The Hound of the Baskervilles (Sherlock Holmes #5)",
      "bookPrice": "£14.82",
      "available": " In stock (4 available)",
      "bookDescription": "Holmes and Watson are faced with their most terrifying case yet. The legend of the devil-beast that haunts the moors around the Baskerville family's home warns the descendants of that ancient clan never to venture out in those dark hours when the power of evil is exalted. Now, the most recent Baskerville, Sir Charles, is dead and the footprints of a giant hound have been f Holmes and Watson are faced with their most terrifying case yet. The legend of the devil-beast that haunts the moors around the Baskerville family's home warns the descendants of that ancient clan never to venture out in those dark hours when the power of evil is exalted. Now, the most recent Baskerville, Sir Charles, is dead and the footprints of a giant hound have been found near his body. Will the new heir meet the same fate? ...more",
      "upc": "6587f46697fc4443"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/55/a9/55a942b0c092c40bdbb6a1f1be340984.jpg",
      "bookTitle": "Little Women (Little Women #1)",
      "bookPrice": "£28.07",
      "available": " In stock (4 available)",
      "bookDescription": "Little Women is the heartwarming story of the March family that has thrilled generations of readers. It is the story of four sisters--Jo, Meg, Amy and Beth-- and of the courage, humor and ingenuity they display to survive poverty and the absence of their father during the Civil War.",
      "upc": "deda806b68b0aa11"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/ac/ee/acee20cff19be38cc3efc5e9b50afae4.jpg",
      "bookTitle": "Gone with the Wind",
      "bookPrice": "£32.49",
      "available": " In stock (4 available)",
      "bookDescription": "Margaret Mitchell's epic novel of love and war won the Pulitzer Prize and one of the most popular and celebrated movies of all time. Many novels have been written about the Civil War and its aftermath. None take us into the burning fields and cities of the American South as Gone With the Wind does, creating haunting scenes and thrilling portraits of characters so vivid tha Margaret Mitchell's epic novel of love and war won the Pulitzer Prize and one of the most popular and celebrated movies of all time. Many novels have been written about the Civil War and its aftermath. None take us into the burning fields and cities of the American South as Gone With the Wind does, creating haunting scenes and thrilling portraits of characters so vivid that we remember their words and feel their fear and hunger for the rest of our lives. In the two main characters, the white-shouldered, irresistible Scarlett and the flashy, contemptuous Rhett, Margaret Mitchell not only conveyed a timeless story of survival under the harshest of circumstances, she also created two of the most famous lovers in the English-speaking world since Romeo and Juliet. ...more",
      "upc": "23310ce84d3c9f85"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/e7/7d/e77d917c495e649216225bd47e006482.jpg",
      "bookTitle": "Candide",
      "bookPrice": "£58.63",
      "available": " In stock (4 available)",
      "bookDescription": "Brought up in the household of a powerful Baron, Candide is an open-minded young man, whose tutor, Pangloss, has instilled in him the belief that 'all is for the best'. But when his love for the Baron's rosy-cheeked daughter is discovered, Candide is cast out to make his own way in the world. And so he and his various companions begin a breathless tour of Europe, South Ame Brought up in the household of a powerful Baron, Candide is an open-minded young man, whose tutor, Pangloss, has instilled in him the belief that 'all is for the best'. But when his love for the Baron's rosy-cheeked daughter is discovered, Candide is cast out to make his own way in the world. And so he and his various companions begin a breathless tour of Europe, South America and Asia, as an outrageous series of disasters befall them - earthquakes, syphilis, a brush with the Inquisition, murder - sorely testing the young hero's optimism. ...more",
      "upc": "2798974abc8a58a8"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/73/b9/73b9d68a89e6d037f1afdc70f96bad09.jpg",
      "bookTitle": "Animal Farm",
      "bookPrice": "£57.22",
      "available": " In stock (4 available)",
      "bookDescription": "Tired of their servitude to man, a group of farm animals revolt and establish their own society, only to be betrayed into worse servitude by their leaders, the pigs, whose slogan becomes: \"All animals are equal, but some animals are more equal than others.\" This 1945 satire addresses the socialist/communist philosophy of Stalin in the Soviet Union.",
      "upc": "1451b55e5e56bb89"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/d8/64/d8644073d00c000cb60643256080cc4b.jpg",
      "bookTitle": "Wuthering Heights",
      "bookPrice": "£17.73",
      "available": " In stock (3 available)",
      "bookDescription": "Wuthering Heights is a wild, passionate story of the intense and almost demonic love between Catherine Earnshaw and Heathcliff, a foundling adopted by Catherine's father. After Mr Earnshaw's death, Heathcliff is bullied and humiliated by Catherine's brother Hindley and wrongly believing that his love for Catherine is not reciprocated, leaves Wuthering Heights, only to retu Wuthering Heights is a wild, passionate story of the intense and almost demonic love between Catherine Earnshaw and Heathcliff, a foundling adopted by Catherine's father. After Mr Earnshaw's death, Heathcliff is bullied and humiliated by Catherine's brother Hindley and wrongly believing that his love for Catherine is not reciprocated, leaves Wuthering Heights, only to return years later as a wealthy and polished man. He proceeds to exact a terrible revenge for his former miseries. The action of the story is chaotic and unremittingly violent, but the accomplished handling of a complex structure, the evocative descriptions of the lonely moorland setting and the poetic grandeur of vision combine to make this unique novel a masterpiece of English literature. ...more",
      "upc": "5a7ff9aaa3168878"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/67/29/67297ff3ae6cb02884c52e5250fe7c1a.jpg",
      "bookTitle": "The Picture of Dorian Gray",
      "bookPrice": "£29.70",
      "available": " In stock (3 available)",
      "bookDescription": "Introduction by Jeffrey Eugenides Written in his distinctively dazzling manner, Oscar Wilde’s story of a fashionable young man who sells his soul for eternal youth and beauty is the author’s most popular work. The tale of Dorian Gray’s moral disintegration caused a scandal when it ﬁrst appeared in 1890, but though Wilde was attacked for the novel’s corrupting inﬂuence, he ﻿Introduction by Jeffrey Eugenides  ﻿Written in his distinctively dazzling manner, Oscar Wilde’s story of a fashionable young man who sells his soul for eternal youth and beauty is the author’s most popular work. The tale of Dorian Gray’s moral disintegration caused a scandal when it ﬁrst appeared in 1890, but though Wilde was attacked for the novel’s corrupting inﬂuence, he responded that there is, in fact, “a terrible moral in Dorian Gray.” Just a few years later, the book and the aesthetic/moral dilemma it presented became issues in the trials occasioned by Wilde’s homosexual liaisons, which resulted in his imprisonment. Of Dorian Gray’s relationship to autobiography, Wilde noted in a letter, “Basil Hallward is what I think I am: Lord Henry what the world thinks me: Dorian what I would like to be—in other ages, perhaps.” ...more",
      "upc": "b9f6305a3d650e2c"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/55/2d/552d55d44dcc0f27e98b3e7dc3959e1a.jpg",
      "bookTitle": "The Complete Stories and Poems (The Works of Edgar Allan Poe [Cameo Edition])",
      "bookPrice": "£26.78",
      "available": " In stock (3 available)",
      "bookDescription": "This single volume brings together all of Poe's stories and poems, and illuminates the diverse and multifaceted genius of one of the greatest and most influential figures in American literary history.",
      "upc": "cad70d6ffd53912f"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/3d/8c/3d8cd7a42d3e57cb10e02f9ab76bd549.jpg",
      "bookTitle": "Beowulf",
      "bookPrice": "£38.35",
      "available": " In stock (3 available)",
      "bookDescription": "The national bestseller and winner of the Whitbread Award. Composed toward the end of the first millennium, Beowulf is the classic Northern epic of a hero’s triumphs as a young warrior and his fated death as a defender of his people. The poem is about encountering the monstrous, defeating it, and then having to live on, physically and psychically exposed in the exhausted a The national bestseller and winner of the Whitbread Award. Composed toward the end of the first millennium, Beowulf is the classic Northern epic of a hero’s triumphs as a young warrior and his fated death as a defender of his people. The poem is about encountering the monstrous, defeating it, and then having to live on, physically and psychically exposed in the exhausted aftermath. It is not hard to draw parallels in this story to the historical curve of consciousness in the twentieth century, but the poem also transcends such considerations, telling us psychological and spiritual truths that are permanent and liberating.Beowulf is considered to have been composed between the 8th and the early 11th century. According to Wikipedia, it was first PUBLISHED in 1814 in a version by John Josias Conybeare. ...more",
      "upc": "3fb69f34e178d494"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/6f/b0/6fb0c3064656f888125ab577b6a01867.jpg",
      "bookTitle": "And Then There Were None",
      "bookPrice": "£35.01",
      "available": " In stock (3 available)",
      "bookDescription": "First, there were ten - a curious assortment of strangers summoned as weekend guests to a private island off the coast of Devon. Their host, an eccentric millionaire unknown to all of them, is nowhere to be found. All that the guests have in common is a wicked past they're unwilling to reveal - and a secret that will seal their fate. For each has been marked for murder. On First, there were ten - a curious assortment of strangers summoned as weekend guests to a private island off the coast of Devon. Their host, an eccentric millionaire unknown to all of them, is nowhere to be found. All that the guests have in common is a wicked past they're unwilling to reveal - and a secret that will seal their fate. For each has been marked for murder. One by one they fall prey. Before the weekend is out, there will be none. And only the dead are above suspicion. ...more",
      "upc": "cfe350b20d23b02b"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/b5/5b/b55be7e5c18b62cef6ebeae404f7f643.jpg",
      "bookTitle": "The Story of Hong Gildong",
      "bookPrice": "£43.19",
      "available": " In stock (1 available)",
      "bookDescription": "The Story of Hong Gildong is arguably the single most important work of classic Korean fiction. Like its English counterpart, Robin Hood, it has been adapted into countless movies, television shows, novels and comics. Its memorable lines are known to virtually every Korean by heart. Until now, this incredible 19th century fable has been all but inaccessible to English read The Story of Hong Gildong is arguably the single most important work of classic Korean fiction. Like its English counterpart, Robin Hood, it has been adapted into countless movies, television shows, novels and comics. Its memorable lines are known to virtually every Korean by heart. Until now, this incredible 19th century fable has been all but inaccessible to English readers.Hong Gildong, the brilliant but illegitimate son of a government minister, cannot advance in society due to his secondary status, so he leaves home to become the leader of a band of outlaws who rob the rich to give to the poor. On the way to building his own empire and gaining acceptance from his family, Hong Gildong vanquishes assassins, battles monsters, and conquers kingdoms. Minsoo Kang's expressive and animated new translation finally makes the original text of this classic available in English, re-introducing a noble and righteous outlaw and sharing a beloved hallmark of Korean culture. ...more",
      "upc": "32d035df92ab9080"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/c0/d6/c0d67625e62981155f5e1f553bda1a94.jpg",
      "bookTitle": "The Little Prince",
      "bookPrice": "£45.42",
      "available": " In stock (1 available)",
      "bookDescription": "Moral allegory and spiritual autobiography, The Little Prince is the most translated book in the French language. With a timeless charm it tells the story of a little boy who leaves the safety of his own tiny planet to travel the universe, learning the vagaries of adult behaviour through a series of extraordinary encounters. His personal odyssey culminates in a voyage to E Moral allegory and spiritual autobiography, The Little Prince is the most translated book in the French language. With a timeless charm it tells the story of a little boy who leaves the safety of his own tiny planet to travel the universe, learning the vagaries of adult behaviour through a series of extraordinary encounters. His personal odyssey culminates in a voyage to Earth and further adventures. ...more",
      "upc": "1aeca7d078d57deb"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/a8/57/a857deea83c7d4c66e2920e1cf5d8fe0.jpg",
      "bookTitle": "Sense and Sensibility",
      "bookPrice": "£37.46",
      "available": " In stock (1 available)",
      "bookDescription": "'The more I know of the world, the more am I convinced that I shall never see a man whom I can really love. I require so much!'Marianne Dashwood wears her heart on her sleeve, and when she falls in love with the dashing but unsuitable John Willoughby she ignores her sister Elinor's warning that her impulsive behaviour leaves her open to gossip and innuendo. Meanwhile Elino 'The more I know of the world, the more am I convinced that I shall never see a man whom I can really love. I require so much!'Marianne Dashwood wears her heart on her sleeve, and when she falls in love with the dashing but unsuitable John Willoughby she ignores her sister Elinor's warning that her impulsive behaviour leaves her open to gossip and innuendo. Meanwhile Elinor, always sensitive to social convention, is struggling to conceal her own romantic disappointment, even from those closest to her. Through their parallel experience of love—and its threatened loss—the sisters learn that sense must mix with sensibility if they are to find personal happiness in a society where status and money govern the rules of love.This edition includes explanatory notes, textual variants between the first and second editions, and Tony Tanner's introduction to the original Penguin Classic edition. ...more",
      "upc": "35e44170702139a4"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/a0/bb/a0bb0881c8ee6f5866804cf0a437853f.jpg",
      "bookTitle": "Of Mice and Men",
      "bookPrice": "£47.11",
      "available": " In stock (1 available)",
      "bookDescription": "The compelling story of two outsiders striving to find their place in an unforgiving world. Drifters in search of work, George and his simple-minded friend Lennie have nothing in the world except each other and a dream--a dream that one day they will have some land of their own. Eventually they find work on a ranch in California’s Salinas Valley, but their hopes are doomed The compelling story of two outsiders striving to find their place in an unforgiving world. Drifters in search of work, George and his simple-minded friend Lennie have nothing in the world except each other and a dream--a dream that one day they will have some land of their own. Eventually they find work on a ranch in California’s Salinas Valley, but their hopes are doomed as Lennie, struggling against extreme cruelty, misunderstanding and feelings of jealousy, becomes a victim of his own strength. Tackling universal themes such as the friendship of a shared vision, and giving voice to America’s lonely and dispossessed, Of Mice and Men has proved one of Steinbeck’s most popular works, achieving success as a novel, a Broadway play and three acclaimed films. ...more",
      "upc": "39592d9d72e717c4"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/ae/98/ae98d08a6f427491dd8eda6b51af41fe.jpg",
      "bookTitle": "Emma",
      "bookPrice": "£32.93",
      "available": " In stock (1 available)",
      "bookDescription": "'I never have been in love; it is not my way, or my nature; and I do not think I ever shall.'Beautiful, clever, rich - and single - Emma Woodhouse is perfectly content with her life and sees no need for either love or marriage. Nothing, however, delights her more than interfering in the romantic lives of others. But when she ignores the warnings of her good friend Mr. Knig 'I never have been in love; it is not my way, or my nature; and I do not think I ever shall.'Beautiful, clever, rich - and single - Emma Woodhouse is perfectly content with her life and sees no need for either love or marriage. Nothing, however, delights her more than interfering in the romantic lives of others. But when she ignores the warnings of her good friend Mr. Knightley and attempts to arrange a suitable match for her protegee Harriet Smith, her carefully laid plans soon unravel and have consequences that she never expected. With its imperfect but charming heroine and its witty and subtle exploration of relationships, Emma is often seen as Jane Austen's most flawless work.This edition includes a new chronology and additional suggestions for further reading. ...more",
      "upc": "2e69730561ed70ad"
    },
    {
      "imageUrl": "https://books.toscrape.com/media/cache/99/df/99df494c230127c3d5ff53153d1f23a3.jpg",
      "bookTitle": "Alice in Wonderland (Alice's Adventures in Wonderland #1)",
      "bookPrice": "£55.53",
      "available": " In stock (1 available)",
      "upc": "cd2a2a70dd5d176d"
    }
  ]
}
